#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: f4771cd83189669eff2c47af94acdd97.pdb
; shader hash: f4771cd83189669eff2c47af94acdd97
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.PerspectiveCamera
;           {
;
;               column_major float4x4 view_to_world;  ; Offset:   16
;               column_major float4x4 projection_to_world;; Offset:   80
;           
;           } camera;                                 ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:   144
;
; }
;
; cbuffer hitgroup_cb
; {
;
;   struct hitgroup_cb
;   {
;
;       struct struct.HitGroupConstantBuffer
;       {
;
;           struct struct.PointLight
;           {
;
;               float4 position;                      ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !66)
!1 = !DIFile(filename: "D:/Code/rally/rally/render/shaders/shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 103, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 103, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 103, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 103, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 106, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 106, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 112, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 112, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !35, !38, !41, !49, !56, !59}
!32 = !DISubprogram(name: "CameraRaygenShader", linkageName: "\01?CameraRaygenShader@@YAXXZ", scope: !1, file: !1, line: 101, type: !33, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?CameraRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "InterpolateFloat3", linkageName: "\01?InterpolateFloat3@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 134, type: !36, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!14, !14, !14, !14, !4}
!38 = !DISubprogram(name: "GetWorldPos", linkageName: "\01?GetWorldPos@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 138, type: !39, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!14}
!41 = !DISubprogram(name: "ComputeRadiance", linkageName: "\01?ComputeRadiance@@YA?AV?$vector@M$02@@UBuiltInTriangleIntersectionAttributes@@_N@Z", scope: !1, file: !1, line: 142, type: !42, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!14, !44, !48}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BarycentricAttributes", file: !1, line: 90, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 140, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !45, file: !1, line: 140, baseType: !5, size: 64, align: 32)
!48 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!49 = !DISubprogram(name: "CameraClosestHitShader", linkageName: "\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 248, type: !50, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !44}
!52 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraRayPayload", file: !1, line: 91, size: 128, align: 32, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !53, file: !1, line: 93, baseType: !22, size: 128, align: 32)
!56 = !DISubprogram(name: "CameraMissShader", linkageName: "\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", scope: !1, file: !1, line: 256, type: !57, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z")
!57 = !DISubroutineType(types: !58)
!58 = !{null, !52}
!59 = !DISubprogram(name: "ShadowMissShader", linkageName: "\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 262, type: !60, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !1, line: 95, size: 32, align: 32, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !63, file: !1, line: 97, baseType: !48, size: 32, align: 32)
!66 = !{!67, !70, !72, !73, !74, !75, !77, !81, !97, !99, !113}
!67 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 128, type: !68, isLocal: true, isDefinition: true, variable: i32 16)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!70 = !DIGlobalVariable(name: "shadow_bias", scope: !41, file: !1, line: 189, type: !71, isLocal: true, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!72 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 197, type: !68, isLocal: true, isDefinition: true, variable: i32 4)
!73 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 198, type: !68, isLocal: true, isDefinition: true, variable: i32 1)
!74 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 199, type: !68, isLocal: true, isDefinition: true, variable: i32 8)
!75 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 75, type: !76, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 75, size: 32, align: 32, elements: !2)
!77 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 76, type: !78, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 76, size: 128, align: 32, elements: !2, templateParams: !79)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "element", type: !23)
!81 = !DIGlobalVariable(name: "vertex_buffer", linkageName: "\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 82, type: !82, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A")
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 82, size: 640, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 27, size: 640, align: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !85, file: !1, line: 29, baseType: !14, size: 96, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !85, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !85, file: !1, line: 31, baseType: !14, size: 96, align: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !85, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !85, file: !1, line: 33, baseType: !14, size: 96, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !85, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !85, file: !1, line: 35, baseType: !14, size: 96, align: 32, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pad3", scope: !85, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 480)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !85, file: !1, line: 37, baseType: !4, size: 64, align: 32, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_pad4", scope: !85, file: !1, line: 38, baseType: !4, size: 64, align: 32, offset: 576)
!97 = !DIGlobalVariable(name: "index_buffer", linkageName: "\01?index_buffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 83, type: !98, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A")
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 83, size: 32, align: 32, elements: !2)
!99 = !DIGlobalVariable(name: "material_buffer", linkageName: "\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 84, type: !100, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A")
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 84, size: 256, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 41, size: 256, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !103, file: !1, line: 43, baseType: !14, size: 96, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reflectance", scope: !103, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !103, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !103, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !103, file: !1, line: 47, baseType: !110, size: 64, align: 32, offset: 192)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, align: 32, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 2)
!113 = !DIGlobalVariable(name: "instance_buffer", linkageName: "\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", scope: !0, file: !1, line: 88, type: !114, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A")
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceBuffer>", file: !1, line: 88, size: 128, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "element", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceBuffer", file: !1, line: 67, size: 128, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_offset", scope: !117, file: !1, line: 68, baseType: !13, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "index_offset", scope: !117, file: !1, line: 69, baseType: !13, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "material_id", scope: !117, file: !1, line: 70, baseType: !13, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !117, file: !1, line: 71, baseType: !13, size: 32, align: 32, offset: 96)
!123 = !{i32 2, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{!"dxc 1.2"}
!126 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define MAX_POINT_LIGHTS 10\0D\0A#define PI 3.14159265359\0D\0A\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct PerspectiveCamera\0D\0A{\0D\0A    float4x4 view_to_world;\0D\0A    float4x4 projection_to_world;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    PerspectiveCamera camera;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float _pad0;\0D\0A    float3 normal;\0D\0A    float _pad1;\0D\0A    float3 tangent;\0D\0A    float _pad2;\0D\0A    float3 bitangent;\0D\0A    float _pad3;\0D\0A    float2 uv;\0D\0A    float2 _pad4;\0D\0A};\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 albedo;\0D\0A    float reflectance;\0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float _pad[2];\0D\0A};\0D\0A\0D\0Astruct PointLight\0D\0A{\0D\0A    float4 position;\0D\0A    float3 color;\0D\0A    float intensity;\0D\0A};\0D\0A\0D\0Astruct PointLightSettings{\0D\0A    int count;\0D\0A    int _pad[47];\0D\0A};\0D\0A\0D\0Astruct HitGroupConstantBuffer{\0D\0A    PointLight point_lights[MAX_POINT_LIGHTS];\0D\0A    PointLightSettings point_light_settings;\0D\0A};\0D\0A\0D\0Astruct InstanceBuffer{\0D\0A    int vertex_offset;\0D\0A    int index_offset;\0D\0A    int material_id;\0D\0A    int _pad;\0D\0A};\0D\0A\0D\0A// Global DXR descriptors\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0A\0D\0A// Local Raygen Constant Buffer\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0A// Global Descriptor Table\0D\0AStructuredBuffer<Vertex> vertex_buffer: register(t1, space0);\0D\0AByteAddressBuffer index_buffer : register(t2, space0);\0D\0AStructuredBuffer<Material> material_buffer : register(t3, space0);\0D\0A\0D\0A// Local Hit Group Descriptor Table\0D\0AConstantBuffer<HitGroupConstantBuffer> hitgroup_cb : register(b1);\0D\0AStructuredBuffer<InstanceBuffer> instance_buffer : register(t4, space0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes BarycentricAttributes;\0D\0Astruct CameraRayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0Astruct ShadowRayPayload\0D\0A{\0D\0A    bool hit;\0D\0A};\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid CameraRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2)DispatchRaysIndex() / (float2)DispatchRaysDimensions();\0D\0A\0D\0A    // Start with projection space coords and direction\0D\0A    float3 proj_dir = float3(0, 0, 1);\0D\0A    float3 proj_origin = float3(\0D\0A    lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A    lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A    0.0f);\0D\0A    // Move to world space\0D\0A    float4 world_pos4 = mul(g_rayGenCB.camera.projection_to_world,float4(proj_origin,1.0f));\0D\0A    float3 world_pos = world_pos4.xyz/world_pos4.w;\0D\0A    // Camera position\0D\0A    float4 camera_pos4 = mul(g_rayGenCB.camera.view_to_world,float4(0.0f,0.0f,0.0f,1.0f));\0D\0A    float3 camera_pos = camera_pos4.xyz/camera_pos4.w;\0D\0A    float3 camera_dir = normalize(world_pos-camera_pos);\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera_pos;\0D\0A    ray.Direction = camera_dir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    CameraRayPayload payload = { float4(0, 0, 0, 1) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0Afloat3 InterpolateFloat3(in float3 a0, in float3 a1, in float3 a2, in float2 barycentrics){\0D\0A    return a0+barycentrics.x*(a1-a0)+barycentrics.y*(a2-a0);\0D\0A}\0D\0A\0D\0Afloat3 GetWorldPos(){\0D\0A    return WorldRayOrigin()+WorldRayDirection()*RayTCurrent();\0D\0A}\0D\0A\0D\0Afloat3 ComputeRadiance(in BarycentricAttributes attr, in bool recurse){\0D\0A    uint instance_id = InstanceID();\0D\0A    int vertex_offset = instance_buffer[instance_id].vertex_offset;\0D\0A    int index_offset = instance_buffer[instance_id].index_offset;\0D\0A\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    uint pidx = PrimitiveIndex();\0D\0A    uint3 idx = index_buffer.Load3((pidx*3+index_offset)*4);\0D\0A    idx += vertex_offset;\0D\0A    \0D\0A    // Get normal\0D\0A    float3 n0 = vertex_buffer[idx.x].normal;\0D\0A    float3 n1 = vertex_buffer[idx.y].normal;\0D\0A    float3 n2 = vertex_buffer[idx.z].normal;\0D\0A    float3 ni = InterpolateFloat3(n0,n1,n2,attr.barycentrics);\0D\0A    float3 world_normal = mul(ObjectToWorld3x4(),float4(ni,0.0f));\0D\0A\0D\0A    // Get world pos\0D\0A    float3 world_pos = GetWorldPos();\0D\0A    \0D\0A    float3 world_camera_pos = WorldRayOrigin();\0D\0A    float3 N = normalize(world_normal);\0D\0A    float3 V = normalize(world_camera_pos-world_pos);\0D\0A    \0D\0A    // PBR material properties\0D\0A    int mat_id = instance_buffer[instance_id].material_id;\0D\0A    float3 albedo = material_buffer[mat_id].albedo;\0D\0A    float reflectance = material_buffer[mat_id].reflectance;\0D\0A    float metallic = material_buffer[mat_id].metallic;\0D\0A    float roughness = material_buffer[mat_id].roughness;\0D\0A\0D\0A    float3 radiance = float3(0.0,0.0,0.0);\0D\0A    for(int light_i = 0; light_i<hitgroup_cb.point_light_settings.count; light_i++){\0D\0A        PointLight point_light = hitgroup_cb.point_lights[light_i];\0D\0A        float3 world_light_pos = point_light.position.xyz;\0D\0A        float3 world_light_dir = world_light_pos-world_pos;\0D\0A        float light_dist = length(world_light_dir);\0D\0A        float light_att = clamp(point_light.intensity/light_dist,0.0f,1.0f);\0D\0A        float3 L = normalize(world_light_dir);\0D\0A        float3 R = normalize(reflect(-L,N));\0D\0A        float3 H = normalize(L+V);\0D\0A\0D\0A        // Light must be incident on surface\0D\0A        if(dot(N,L)<0)\0D\0A            continue;\0D\0A\0D\0A        // Trace Shadow Ray\0D\0A        const float shadow_bias = 0.001;\0D\0A        ShadowRayPayload shadow_payload = {true};\0D\0A        RayDesc shadow_ray;\0D\0A        shadow_ray.Origin = world_light_pos;\0D\0A        shadow_ray.Direction = -normalize(world_light_dir);\0D\0A        shadow_ray.TMin = 0.001;\0D\0A        shadow_ray.TMax = light_dist - shadow_bias;\0D\0A        TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES\0D\0A        | RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH\0D\0A        | RAY_FLAG_FORCE_OPAQUE             \0D\0A        | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER,\0D\0A        ~0,1,0,1,shadow_ray,shadow_payload);\0D\0A        if(shadow_payload.hit) light_att = 0.0f;\0D\0A\0D\0A        // Surface must not be in shadow or out of light range\0D\0A        if(light_att<=0.0)\0D\0A            continue;\0D\0A\0D\0A        // Fresnel Reflectance\0D\0A        // Shlick Approximation\0D\0A        float3 F0 = 0.16*reflectance*reflectance*(1.0-metallic)+albedo*metallic;\0D\0A        float3 Fhl = F0+(1-F0)*pow(1-max(dot(H,L),0.0),5.0);\0D\0A\0D\0A        // Normal Distribution Function (NDF)\0D\0A        // GGX Distribution\0D\0A        float Dh = roughness/(PI*pow(1.0+pow(dot(N,H),2.0)*(roughness-1.0),2.0));\0D\0A\0D\0A        // Masking Function\0D\0A        // Height-correlated Smith G2\0D\0A        float mu_i = dot(N,L);\0D\0A        float mu_o = dot(N,H);\0D\0A        float G2_denom1 = mu_o*sqrt(roughness+mu_i*(mu_i-roughness*mu_i));\0D\0A        float G2_denom2 = mu_i*sqrt(roughness+mu_o*(mu_o-roughness*mu_o));\0D\0A        float G2 = 0.5/(G2_denom1+G2_denom2);\0D\0A\0D\0A        // Specular component\0D\0A        radiance += light_att*point_light.color*Fhl*G2*Dh*mu_i;\0D\0A        \0D\0A        // Diffuse component\0D\0A        radiance += light_att*point_light.color*(1.0-Fhl)*(1.0-metallic)*(albedo/PI)*mu_i;\0D\0A    }\0D\0A    \0D\0A    if(recurse){\0D\0A        // TODO: Move reflectivity parameter to material properties\0D\0A        float reflectivity = 0.8f;\0D\0A\0D\0A        CameraRayPayload reflect_payload = {float4(0,0,0,0)};\0D\0A        RayDesc reflect_ray;\0D\0A        reflect_ray.Origin = world_pos;\0D\0A        reflect_ray.Direction = normalize(reflect(-V,N));\0D\0A        reflect_ray.TMin = 0.001;\0D\0A        reflect_ray.TMax = 10000.0;\0D\0A        TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, reflect_ray, reflect_payload);\0D\0A        radiance += reflectivity*reflect_payload.color.rgb;\0D\0A    }\0D\0A    return radiance;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid CameraClosestHitShader(inout CameraRayPayload payload, in BarycentricAttributes attr)\0D\0A{\0D\0A    bool recurse = payload.color.w > 0.0;\0D\0A    float3 radiance = ComputeRadiance(attr, recurse);\0D\0A    payload.color = float4(radiance, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid CameraMissShader(inout CameraRayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid ShadowMissShader(inout ShadowRayPayload payload)\0D\0A{\0D\0A    payload.hit = false;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!127 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl"}
!128 = !{!"-T", !"lib_6_3", !"-Zi", !"-Qembed_debug"}
!129 = !{i32 1, i32 3}
!130 = !{i32 1, i32 5}
!131 = !{!"lib", i32 6, i32 3}
!132 = !{!133, !143, !146, null}
!133 = !{!134, !136, !138, !139, !141}
!134 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !135}
!135 = !{i32 0, i32 4}
!136 = !{i32 1, %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", !"vertex_buffer", i32 0, i32 1, i32 1, i32 12, i32 0, !137}
!137 = !{i32 1, i32 80}
!138 = !{i32 2, %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A", !"index_buffer", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!139 = !{i32 3, %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", !"material_buffer", i32 0, i32 3, i32 1, i32 12, i32 0, !140}
!140 = !{i32 1, i32 32}
!141 = !{i32 4, %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", !"instance_buffer", i32 0, i32 4, i32 1, i32 12, i32 0, !142}
!142 = !{i32 1, i32 16}
!143 = !{!144}
!144 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !145}
!145 = !{i32 0, i32 9}
!146 = !{!147, !148}
!147 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 144, null}
!148 = !{i32 1, %hitgroup_cb* @hitgroup_cb, !"hitgroup_cb", i32 0, i32 1, i32 1, i32 1076, null}
!149 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !150, %"class.RWTexture2D<vector<float, 4> >" undef, !152, %struct.RayGenConstantBuffer undef, !154, %struct.Viewport undef, !157, %struct.PerspectiveCamera undef, !162, %"class.StructuredBuffer<Vertex>" undef, !166, %struct.Vertex undef, !168, %struct.ByteAddressBuffer undef, !150, %"class.StructuredBuffer<Material>" undef, !179, %struct.Material undef, !180, %struct.HitGroupConstantBuffer undef, !186, %struct.PointLight undef, !189, %struct.PointLightSettings undef, !192, %"class.StructuredBuffer<InstanceBuffer>" undef, !195, %struct.InstanceBuffer undef, !196, %struct.RayDesc undef, !201, %struct.CameraRayPayload undef, !206, %struct.BuiltInTriangleIntersectionAttributes undef, !208, %struct.ShadowRayPayload undef, !210, %g_rayGenCB undef, !212, %hitgroup_cb undef, !214}
!150 = !{i32 4, !151}
!151 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!152 = !{i32 16, !153}
!153 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!154 = !{i32 144, !155, !156}
!155 = !{i32 6, !"viewport", i32 3, i32 0}
!156 = !{i32 6, !"camera", i32 3, i32 16}
!157 = !{i32 16, !158, !159, !160, !161}
!158 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!159 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!160 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!161 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!162 = !{i32 128, !163, !165}
!163 = !{i32 6, !"view_to_world", i32 2, !164, i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 4, i32 4, i32 2}
!165 = !{i32 6, !"projection_to_world", i32 2, !164, i32 3, i32 64, i32 7, i32 9}
!166 = !{i32 80, !167}
!167 = !{i32 6, !"h", i32 3, i32 0}
!168 = !{i32 80, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!169 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!170 = !{i32 6, !"_pad0", i32 3, i32 12, i32 7, i32 9}
!171 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!172 = !{i32 6, !"_pad1", i32 3, i32 28, i32 7, i32 9}
!173 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!174 = !{i32 6, !"_pad2", i32 3, i32 44, i32 7, i32 9}
!175 = !{i32 6, !"bitangent", i32 3, i32 48, i32 7, i32 9}
!176 = !{i32 6, !"_pad3", i32 3, i32 60, i32 7, i32 9}
!177 = !{i32 6, !"uv", i32 3, i32 64, i32 7, i32 9}
!178 = !{i32 6, !"_pad4", i32 3, i32 72, i32 7, i32 9}
!179 = !{i32 52, !167}
!180 = !{i32 52, !181, !182, !183, !184, !185}
!181 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!182 = !{i32 6, !"reflectance", i32 3, i32 12, i32 7, i32 9}
!183 = !{i32 6, !"metallic", i32 3, i32 16, i32 7, i32 9}
!184 = !{i32 6, !"roughness", i32 3, i32 20, i32 7, i32 9}
!185 = !{i32 6, !"_pad", i32 3, i32 32, i32 7, i32 9}
!186 = !{i32 1076, !187, !188}
!187 = !{i32 6, !"point_lights", i32 3, i32 0}
!188 = !{i32 6, !"point_light_settings", i32 3, i32 320}
!189 = !{i32 32, !169, !190, !191}
!190 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9}
!191 = !{i32 6, !"intensity", i32 3, i32 28, i32 7, i32 9}
!192 = !{i32 756, !193, !194}
!193 = !{i32 6, !"count", i32 3, i32 0, i32 7, i32 4}
!194 = !{i32 6, !"_pad", i32 3, i32 16, i32 7, i32 4}
!195 = !{i32 16, !167}
!196 = !{i32 16, !197, !198, !199, !200}
!197 = !{i32 6, !"vertex_offset", i32 3, i32 0, i32 7, i32 4}
!198 = !{i32 6, !"index_offset", i32 3, i32 4, i32 7, i32 4}
!199 = !{i32 6, !"material_id", i32 3, i32 8, i32 7, i32 4}
!200 = !{i32 6, !"_pad", i32 3, i32 12, i32 7, i32 4}
!201 = !{i32 32, !202, !203, !204, !205}
!202 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!203 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!204 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!205 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!206 = !{i32 16, !207}
!207 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!208 = !{i32 8, !209}
!209 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!210 = !{i32 4, !211}
!211 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!212 = !{i32 144, !213}
!213 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!214 = !{i32 1076, !215}
!215 = !{i32 6, !"hitgroup_cb", i32 3, i32 0}
!216 = !{i32 1, void ()* @"\01?CameraRaygenShader@@YAXXZ", !217, void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !219, void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", !222, void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", !222}
!217 = !{!218}
!218 = !{i32 1, !2, !2}
!219 = !{!218, !220, !221}
!220 = !{i32 2, !2, !2}
!221 = !{i32 0, !2, !2}
!222 = !{!218, !220}
!223 = !{null, !"", null, !132, !224}
!224 = !{i32 0, i64 65552}
!225 = !{void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !226}
!226 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !227}
!227 = !{i32 0}
!228 = !{void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", !"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", null, null, !229}
!229 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !227}
!230 = !{void ()* @"\01?CameraRaygenShader@@YAXXZ", !"\01?CameraRaygenShader@@YAXXZ", null, null, !231}
!231 = !{i32 8, i32 7, i32 5, !227}
!232 = !{void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", !"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", null, null, !233}
!233 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !227}
!234 = !DILocation(line: 103, column: 33, scope: !32)
!235 = !DILocation(line: 103, column: 63, scope: !32)
!236 = !DILocation(line: 103, column: 53, scope: !32)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !32, file: !1, line: 103, type: !4)
!238 = !DIExpression(DW_OP_bit_piece, 0, 32)
!239 = !DILocation(line: 103, column: 12, scope: !32)
!240 = !DIExpression(DW_OP_bit_piece, 32, 32)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj_dir", scope: !32, file: !1, line: 106, type: !14)
!242 = !DIExpression()
!243 = !DILocation(line: 106, column: 12, scope: !32)
!244 = !DILocation(line: 108, column: 56, scope: !32)
!245 = !DILocation(line: 108, column: 30, scope: !32)
!246 = !DILocation(line: 108, column: 5, scope: !32)
!247 = !DILocation(line: 109, column: 55, scope: !32)
!248 = !DILocation(line: 109, column: 30, scope: !32)
!249 = !DILocation(line: 109, column: 5, scope: !32)
!250 = !DILocation(line: 112, column: 47, scope: !32)
!251 = !DILocation(line: 112, column: 25, scope: !32)
!252 = !DILocation(line: 113, column: 24, scope: !32)
!253 = !DILocation(line: 113, column: 39, scope: !32)
!254 = !DILocation(line: 113, column: 38, scope: !32)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !32, file: !1, line: 113, type: !14)
!256 = !DILocation(line: 113, column: 12, scope: !32)
!257 = !DIExpression(DW_OP_bit_piece, 64, 32)
!258 = !DILocation(line: 115, column: 48, scope: !32)
!259 = !DILocation(line: 116, column: 25, scope: !32)
!260 = !DILocation(line: 116, column: 41, scope: !32)
!261 = !DILocation(line: 116, column: 40, scope: !32)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_pos", scope: !32, file: !1, line: 116, type: !14)
!263 = !DILocation(line: 116, column: 12, scope: !32)
!264 = !DILocation(line: 117, column: 44, scope: !32)
!265 = !DILocation(line: 117, column: 25, scope: !32)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_dir", scope: !32, file: !1, line: 117, type: !14)
!267 = !DILocation(line: 117, column: 12, scope: !32)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 127, type: !53)
!269 = !DILocation(line: 127, column: 22, scope: !32)
!270 = !DILocation(line: 128, column: 5, scope: !32)
!271 = !DILocation(line: 131, column: 5, scope: !32)
!272 = !DILocation(line: 131, column: 42, scope: !32)
!273 = !DILocation(line: 132, column: 1, scope: !32)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !49, file: !1, line: 248, type: !44)
!275 = !DIExpression(DW_OP_deref)
!276 = !DILocation(line: 248, column: 86, scope: !49)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !49, file: !1, line: 248, type: !52)
!278 = !DILocation(line: 248, column: 52, scope: !49)
!279 = !DILocation(line: 250, column: 28, scope: !49)
!280 = !DILocation(line: 250, column: 20, scope: !49)
!281 = !DILocation(line: 250, column: 36, scope: !49)
!282 = !DILocation(line: 251, column: 23, scope: !49)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 1, scope: !41, file: !1, line: 142, type: !44)
!284 = !DILocation(line: 142, column: 49, scope: !41, inlinedAt: !285)
!285 = distinct !DILocation(line: 251, column: 23, scope: !49)
!286 = !DILocation(line: 143, column: 24, scope: !41, inlinedAt: !285)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_id", scope: !41, file: !1, line: 143, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 143, baseType: !69)
!289 = !DILocation(line: 143, column: 10, scope: !41, inlinedAt: !285)
!290 = !DILocation(line: 144, column: 25, scope: !41, inlinedAt: !285)
!291 = !DILocation(line: 144, column: 54, scope: !41, inlinedAt: !285)
!292 = !DILocation(line: 150, column: 12, scope: !41, inlinedAt: !285)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vertex_offset", scope: !41, file: !1, line: 144, type: !13)
!294 = !DILocation(line: 144, column: 9, scope: !41, inlinedAt: !285)
!295 = !DILocation(line: 145, column: 53, scope: !41, inlinedAt: !285)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index_offset", scope: !41, file: !1, line: 145, type: !13)
!297 = !DILocation(line: 145, column: 9, scope: !41, inlinedAt: !285)
!298 = !DILocation(line: 148, column: 17, scope: !41, inlinedAt: !285)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pidx", scope: !41, file: !1, line: 148, type: !288)
!300 = !DILocation(line: 148, column: 10, scope: !41, inlinedAt: !285)
!301 = !DILocation(line: 149, column: 41, scope: !41, inlinedAt: !285)
!302 = !DILocation(line: 149, column: 43, scope: !41, inlinedAt: !285)
!303 = !DILocation(line: 149, column: 57, scope: !41, inlinedAt: !285)
!304 = !DILocation(line: 149, column: 17, scope: !41, inlinedAt: !285)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !41, file: !1, line: 149, type: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 149, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 149, size: 96, align: 32, elements: !308, templateParams: !312)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !307, file: !1, line: 149, baseType: !69, size: 32, align: 32, flags: DIFlagPublic)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !307, file: !1, line: 149, baseType: !69, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !307, file: !1, line: 149, baseType: !69, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!312 = !{!313, !21}
!313 = !DITemplateTypeParameter(name: "element", type: !69)
!314 = !DILocation(line: 149, column: 11, scope: !41, inlinedAt: !285)
!315 = !DILocation(line: 150, column: 9, scope: !41, inlinedAt: !285)
!316 = !DILocation(line: 153, column: 17, scope: !41, inlinedAt: !285)
!317 = !DILocation(line: 153, column: 38, scope: !41, inlinedAt: !285)
!318 = !DILocation(line: 154, column: 38, scope: !41, inlinedAt: !285)
!319 = !DILocation(line: 155, column: 38, scope: !41, inlinedAt: !285)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barycentrics", arg: 4, scope: !35, file: !1, line: 134, type: !4)
!321 = !DILocation(line: 134, column: 78, scope: !35, inlinedAt: !322)
!322 = distinct !DILocation(line: 156, column: 17, scope: !41, inlinedAt: !285)
!323 = !DILocation(line: 135, column: 15, scope: !35, inlinedAt: !322)
!324 = !DILocation(line: 135, column: 33, scope: !35, inlinedAt: !322)
!325 = !DILocation(line: 135, column: 29, scope: !35, inlinedAt: !322)
!326 = !DILocation(line: 135, column: 14, scope: !35, inlinedAt: !322)
!327 = !DILocation(line: 135, column: 38, scope: !35, inlinedAt: !322)
!328 = !DILocation(line: 135, column: 56, scope: !35, inlinedAt: !322)
!329 = !DILocation(line: 135, column: 52, scope: !35, inlinedAt: !322)
!330 = !DILocation(line: 135, column: 37, scope: !35, inlinedAt: !322)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ni", scope: !41, file: !1, line: 156, type: !14)
!332 = !DILocation(line: 156, column: 12, scope: !41, inlinedAt: !285)
!333 = !DILocation(line: 157, column: 31, scope: !41, inlinedAt: !285)
!334 = !DILocation(line: 157, column: 27, scope: !41, inlinedAt: !285)
!335 = !DILocation(line: 139, column: 12, scope: !38, inlinedAt: !336)
!336 = distinct !DILocation(line: 160, column: 24, scope: !41, inlinedAt: !285)
!337 = !DILocation(line: 139, column: 29, scope: !38, inlinedAt: !336)
!338 = !DILocation(line: 139, column: 49, scope: !38, inlinedAt: !336)
!339 = !DILocation(line: 139, column: 48, scope: !38, inlinedAt: !336)
!340 = !DILocation(line: 139, column: 28, scope: !38, inlinedAt: !336)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !41, file: !1, line: 160, type: !14)
!342 = !DILocation(line: 160, column: 12, scope: !41, inlinedAt: !285)
!343 = !DILocation(line: 163, column: 16, scope: !41, inlinedAt: !285)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !41, file: !1, line: 163, type: !14)
!345 = !DILocation(line: 163, column: 12, scope: !41, inlinedAt: !285)
!346 = !DILocation(line: 164, column: 42, scope: !41, inlinedAt: !285)
!347 = !DILocation(line: 164, column: 16, scope: !41, inlinedAt: !285)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !41, file: !1, line: 164, type: !14)
!349 = !DILocation(line: 164, column: 12, scope: !41, inlinedAt: !285)
!350 = !DILocation(line: 167, column: 47, scope: !41, inlinedAt: !285)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat_id", scope: !41, file: !1, line: 167, type: !13)
!352 = !DILocation(line: 167, column: 9, scope: !41, inlinedAt: !285)
!353 = !DILocation(line: 168, column: 21, scope: !41, inlinedAt: !285)
!354 = !DILocation(line: 168, column: 45, scope: !41, inlinedAt: !285)
!355 = !DILocation(line: 169, column: 49, scope: !41, inlinedAt: !285)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reflectance", scope: !41, file: !1, line: 169, type: !8)
!357 = !DILocation(line: 169, column: 11, scope: !41, inlinedAt: !285)
!358 = !DILocation(line: 170, column: 46, scope: !41, inlinedAt: !285)
!359 = !DILocation(line: 209, column: 72, scope: !360, inlinedAt: !285)
!360 = distinct !DILexicalBlock(scope: !361, file: !1, line: 174, column: 84)
!361 = distinct !DILexicalBlock(scope: !362, file: !1, line: 174, column: 5)
