#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 7249768b1ac2e97c02b98ad209f16db6.pdb
; shader hash: 7249768b1ac2e97c02b98ad209f16db6
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.PerspectiveCamera
;           {
;
;               column_major float4x4 view_to_world;  ; Offset:   16
;               column_major float4x4 projection_to_world;; Offset:   80
;           
;           } camera;                                 ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:   144
;
; }
;
; cbuffer hitgroup_cb
; {
;
;   struct hitgroup_cb
;   {
;
;       struct struct.HitGroupConstantBuffer
;       {
;
;           struct struct.PointLight
;           {
;
;               float4 position;                      ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !63)
!1 = !DIFile(filename: "D:/Code/rally/rally/render/shaders/shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 103, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 103, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 103, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 103, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 106, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 106, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 112, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 112, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !35, !38, !41, !52, !55}
!32 = !DISubprogram(name: "CameraRaygenShader", linkageName: "\01?CameraRaygenShader@@YAXXZ", scope: !1, file: !1, line: 101, type: !33, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?CameraRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "InterpolateFloat3", linkageName: "\01?InterpolateFloat3@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 134, type: !36, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!14, !14, !14, !14, !4}
!38 = !DISubprogram(name: "GetWorldPos", linkageName: "\01?GetWorldPos@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 138, type: !39, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!14}
!41 = !DISubprogram(name: "CameraClosestHitShader", linkageName: "\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 143, type: !42, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !48}
!44 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraRayPayload", file: !1, line: 91, size: 128, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !45, file: !1, line: 93, baseType: !22, size: 128, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 90, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 140, size: 64, align: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !49, file: !1, line: 140, baseType: !5, size: 64, align: 32)
!52 = !DISubprogram(name: "CameraMissShader", linkageName: "\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", scope: !1, file: !1, line: 236, type: !53, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !44}
!55 = !DISubprogram(name: "ShadowMissShader", linkageName: "\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 242, type: !56, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z")
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58}
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !1, line: 95, size: 32, align: 32, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !59, file: !1, line: 97, baseType: !62, size: 32, align: 32)
!62 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!63 = !{!64, !67, !69, !70, !71, !72, !74, !78, !94, !96, !110}
!64 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 128, type: !65, isLocal: true, isDefinition: true, variable: i32 16)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!67 = !DIGlobalVariable(name: "shadow_bias", scope: !41, file: !1, line: 191, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!69 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 199, type: !65, isLocal: true, isDefinition: true, variable: i32 4)
!70 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 200, type: !65, isLocal: true, isDefinition: true, variable: i32 1)
!71 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 201, type: !65, isLocal: true, isDefinition: true, variable: i32 8)
!72 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 75, type: !73, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 75, size: 32, align: 32, elements: !2)
!74 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 76, type: !75, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 76, size: 128, align: 32, elements: !2, templateParams: !76)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "element", type: !23)
!78 = !DIGlobalVariable(name: "vertex_buffer", linkageName: "\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 82, type: !79, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A")
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 82, size: 640, align: 32, elements: !2, templateParams: !80)
!80 = !{!81}
!81 = !DITemplateTypeParameter(name: "element", type: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 27, size: 640, align: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !82, file: !1, line: 29, baseType: !14, size: 96, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !82, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !82, file: !1, line: 31, baseType: !14, size: 96, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !82, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !82, file: !1, line: 33, baseType: !14, size: 96, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !82, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !82, file: !1, line: 35, baseType: !14, size: 96, align: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pad3", scope: !82, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 480)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !82, file: !1, line: 37, baseType: !4, size: 64, align: 32, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_pad4", scope: !82, file: !1, line: 38, baseType: !4, size: 64, align: 32, offset: 576)
!94 = !DIGlobalVariable(name: "index_buffer", linkageName: "\01?index_buffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 83, type: !95, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 83, size: 32, align: 32, elements: !2)
!96 = !DIGlobalVariable(name: "material_buffer", linkageName: "\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 84, type: !97, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A")
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 84, size: 256, align: 32, elements: !2, templateParams: !98)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "element", type: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 41, size: 256, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !100, file: !1, line: 43, baseType: !14, size: 96, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reflectance", scope: !100, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "metallic", scope: !100, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !100, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !100, file: !1, line: 47, baseType: !107, size: 64, align: 32, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, align: 32, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 2)
!110 = !DIGlobalVariable(name: "instance_buffer", linkageName: "\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", scope: !0, file: !1, line: 88, type: !111, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A")
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceBuffer>", file: !1, line: 88, size: 128, align: 32, elements: !2, templateParams: !112)
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "element", type: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceBuffer", file: !1, line: 67, size: 128, align: 32, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_offset", scope: !114, file: !1, line: 68, baseType: !13, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "index_offset", scope: !114, file: !1, line: 69, baseType: !13, size: 32, align: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "material_id", scope: !114, file: !1, line: 70, baseType: !13, size: 32, align: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !114, file: !1, line: 71, baseType: !13, size: 32, align: 32, offset: 96)
!120 = !{i32 2, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{!"dxc 1.2"}
!123 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define MAX_POINT_LIGHTS 10\0D\0A#define PI 3.14159265359\0D\0A\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct PerspectiveCamera\0D\0A{\0D\0A    float4x4 view_to_world;\0D\0A    float4x4 projection_to_world;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    PerspectiveCamera camera;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float _pad0;\0D\0A    float3 normal;\0D\0A    float _pad1;\0D\0A    float3 tangent;\0D\0A    float _pad2;\0D\0A    float3 bitangent;\0D\0A    float _pad3;\0D\0A    float2 uv;\0D\0A    float2 _pad4;\0D\0A};\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 albedo;\0D\0A    float reflectance;\0D\0A    float metallic;\0D\0A    float roughness;\0D\0A    float _pad[2];\0D\0A};\0D\0A\0D\0Astruct PointLight\0D\0A{\0D\0A    float4 position;\0D\0A    float3 color;\0D\0A    float intensity;\0D\0A};\0D\0A\0D\0Astruct PointLightSettings{\0D\0A    int count;\0D\0A    int _pad[47];\0D\0A};\0D\0A\0D\0Astruct HitGroupConstantBuffer{\0D\0A    PointLight point_lights[MAX_POINT_LIGHTS];\0D\0A    PointLightSettings point_light_settings;\0D\0A};\0D\0A\0D\0Astruct InstanceBuffer{\0D\0A    int vertex_offset;\0D\0A    int index_offset;\0D\0A    int material_id;\0D\0A    int _pad;\0D\0A};\0D\0A\0D\0A// Global DXR descriptors\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0A\0D\0A// Local Raygen Constant Buffer\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0A// Global Descriptor Table\0D\0AStructuredBuffer<Vertex> vertex_buffer: register(t1, space0);\0D\0AByteAddressBuffer index_buffer : register(t2, space0);\0D\0AStructuredBuffer<Material> material_buffer : register(t3, space0);\0D\0A\0D\0A// Local Hit Group Descriptor Table\0D\0AConstantBuffer<HitGroupConstantBuffer> hitgroup_cb : register(b1);\0D\0AStructuredBuffer<InstanceBuffer> instance_buffer : register(t4, space0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct CameraRayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0Astruct ShadowRayPayload\0D\0A{\0D\0A    bool hit;\0D\0A};\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid CameraRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2)DispatchRaysIndex() / (float2)DispatchRaysDimensions();\0D\0A\0D\0A    // Start with projection space coords and direction\0D\0A    float3 proj_dir = float3(0, 0, 1);\0D\0A    float3 proj_origin = float3(\0D\0A    lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A    lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A    0.0f);\0D\0A    // Move to world space\0D\0A    float4 world_pos4 = mul(g_rayGenCB.camera.projection_to_world,float4(proj_origin,1.0f));\0D\0A    float3 world_pos = world_pos4.xyz/world_pos4.w;\0D\0A    // Camera position\0D\0A    float4 camera_pos4 = mul(g_rayGenCB.camera.view_to_world,float4(0.0f,0.0f,0.0f,1.0f));\0D\0A    float3 camera_pos = camera_pos4.xyz/camera_pos4.w;\0D\0A    float3 camera_dir = normalize(world_pos-camera_pos);\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera_pos;\0D\0A    ray.Direction = camera_dir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    CameraRayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0Afloat3 InterpolateFloat3(in float3 a0, in float3 a1, in float3 a2, in float2 barycentrics){\0D\0A    return a0+barycentrics.x*(a1-a0)+barycentrics.y*(a2-a0);\0D\0A}\0D\0A\0D\0Afloat3 GetWorldPos(){\0D\0A    return WorldRayOrigin()+WorldRayDirection()*RayTCurrent();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid CameraClosestHitShader(inout CameraRayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint instance_id = InstanceID();\0D\0A    int vertex_offset = instance_buffer[instance_id].vertex_offset;\0D\0A    int index_offset = instance_buffer[instance_id].index_offset;\0D\0A\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    uint pidx = PrimitiveIndex();\0D\0A    uint3 idx = index_buffer.Load3((pidx*3+index_offset)*4);\0D\0A    idx += vertex_offset;\0D\0A    \0D\0A    // Get normal\0D\0A    float3 n0 = vertex_buffer[idx.x].normal;\0D\0A    float3 n1 = vertex_buffer[idx.y].normal;\0D\0A    float3 n2 = vertex_buffer[idx.z].normal;\0D\0A    float3 ni = InterpolateFloat3(n0,n1,n2,attr.barycentrics);\0D\0A    float3 world_normal = mul(ObjectToWorld3x4(),float4(ni,0.0f));\0D\0A\0D\0A    // Get world pos\0D\0A    float3 world_pos = GetWorldPos();\0D\0A    \0D\0A    float3 world_camera_pos = WorldRayOrigin();\0D\0A    float3 N = normalize(world_normal);\0D\0A    float3 V = normalize(world_camera_pos-world_pos);\0D\0A    \0D\0A    // PBR material properties\0D\0A    int mat_id = instance_buffer[instance_id].material_id;\0D\0A    float3 albedo = material_buffer[mat_id].albedo;\0D\0A    float reflectance = material_buffer[mat_id].reflectance;\0D\0A    float metallic = material_buffer[mat_id].metallic;\0D\0A    float roughness = material_buffer[mat_id].roughness;\0D\0A\0D\0A    float3 radiance = float3(0.0,0.0,0.0);\0D\0A    for(int light_i = 0; light_i<hitgroup_cb.point_light_settings.count; light_i++){\0D\0A        PointLight point_light = hitgroup_cb.point_lights[light_i];\0D\0A        float3 world_light_pos = point_light.position.xyz;\0D\0A        float3 world_light_dir = world_light_pos-world_pos;\0D\0A        float light_dist = length(world_light_dir);\0D\0A        float light_att = clamp(point_light.intensity/light_dist,0.0f,1.0f);\0D\0A        float3 L = normalize(world_light_dir);\0D\0A        float3 R = normalize(reflect(-L,N));\0D\0A        float3 H = normalize(L+V);\0D\0A\0D\0A        // Light must be incident on surface\0D\0A        if(dot(N,L)<0)\0D\0A            continue;\0D\0A\0D\0A        // Trace Shadow Ray\0D\0A        const float shadow_bias = 0.001;\0D\0A        ShadowRayPayload shadow_payload = {true};\0D\0A        RayDesc shadow_ray;\0D\0A        shadow_ray.Origin = world_light_pos;\0D\0A        shadow_ray.Direction = -normalize(world_light_dir);\0D\0A        shadow_ray.TMin = 0.001;\0D\0A        shadow_ray.TMax = light_dist - shadow_bias;\0D\0A        TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES\0D\0A        | RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH\0D\0A        | RAY_FLAG_FORCE_OPAQUE             \0D\0A        | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER,\0D\0A        ~0,1,0,1,shadow_ray,shadow_payload);\0D\0A        if(shadow_payload.hit) light_att = 0.0f;\0D\0A\0D\0A        // Surface must not be in shadow or out of light range\0D\0A        if(light_att<=0.0)\0D\0A            continue;\0D\0A\0D\0A        // Fresnel Reflectance\0D\0A        // Shlick Approximation\0D\0A        float3 F0 = 0.16*reflectance*reflectance*(1.0-metallic)+albedo*metallic;\0D\0A        float3 Fhl = F0+(1-F0)*pow(1-max(dot(H,L),0.0),5.0);\0D\0A\0D\0A        // Normal Distribution Function (NDF)\0D\0A        // GGX Distribution\0D\0A        float Dh = roughness/(PI*pow(1.0+pow(dot(N,H),2.0)*(roughness-1.0),2.0));\0D\0A\0D\0A        // Masking Function\0D\0A        // Height-correlated Smith G2\0D\0A        float mu_i = dot(N,L);\0D\0A        float mu_o = dot(N,H);\0D\0A        float G2_denom1 = mu_o*sqrt(roughness+mu_i*(mu_i-roughness*mu_i));\0D\0A        float G2_denom2 = mu_i*sqrt(roughness+mu_o*(mu_o-roughness*mu_o));\0D\0A        float G2 = 0.5/(G2_denom1+G2_denom2);\0D\0A\0D\0A        // Specular component\0D\0A        radiance += light_att*point_light.color*Fhl*G2*Dh*mu_i;\0D\0A        \0D\0A        // Diffuse component\0D\0A        radiance += light_att*point_light.color*(1.0-Fhl)*(1.0-metallic)*(albedo/PI)*mu_i;\0D\0A    }\0D\0A    payload.color = float4(radiance, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid CameraMissShader(inout CameraRayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid ShadowMissShader(inout ShadowRayPayload payload)\0D\0A{\0D\0A    payload.hit = false;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!124 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl"}
!125 = !{!"-T", !"lib_6_3", !"-Zi", !"-Qembed_debug"}
!126 = !{i32 1, i32 3}
!127 = !{i32 1, i32 5}
!128 = !{!"lib", i32 6, i32 3}
!129 = !{!130, !140, !143, null}
!130 = !{!131, !133, !135, !136, !138}
!131 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !132}
!132 = !{i32 0, i32 4}
!133 = !{i32 1, %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", !"vertex_buffer", i32 0, i32 1, i32 1, i32 12, i32 0, !134}
!134 = !{i32 1, i32 80}
!135 = !{i32 2, %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A", !"index_buffer", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!136 = !{i32 3, %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", !"material_buffer", i32 0, i32 3, i32 1, i32 12, i32 0, !137}
!137 = !{i32 1, i32 32}
!138 = !{i32 4, %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", !"instance_buffer", i32 0, i32 4, i32 1, i32 12, i32 0, !139}
!139 = !{i32 1, i32 16}
!140 = !{!141}
!141 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !142}
!142 = !{i32 0, i32 9}
!143 = !{!144, !145}
!144 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 144, null}
!145 = !{i32 1, %hitgroup_cb* @hitgroup_cb, !"hitgroup_cb", i32 0, i32 1, i32 1, i32 1076, null}
!146 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !147, %"class.RWTexture2D<vector<float, 4> >" undef, !149, %struct.RayGenConstantBuffer undef, !151, %struct.Viewport undef, !154, %struct.PerspectiveCamera undef, !159, %"class.StructuredBuffer<Vertex>" undef, !163, %struct.Vertex undef, !165, %struct.ByteAddressBuffer undef, !147, %"class.StructuredBuffer<Material>" undef, !176, %struct.Material undef, !177, %struct.HitGroupConstantBuffer undef, !183, %struct.PointLight undef, !186, %struct.PointLightSettings undef, !189, %"class.StructuredBuffer<InstanceBuffer>" undef, !192, %struct.InstanceBuffer undef, !193, %struct.RayDesc undef, !198, %struct.CameraRayPayload undef, !203, %struct.BuiltInTriangleIntersectionAttributes undef, !205, %struct.ShadowRayPayload undef, !207, %g_rayGenCB undef, !209, %hitgroup_cb undef, !211}
!147 = !{i32 4, !148}
!148 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!149 = !{i32 16, !150}
!150 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!151 = !{i32 144, !152, !153}
!152 = !{i32 6, !"viewport", i32 3, i32 0}
!153 = !{i32 6, !"camera", i32 3, i32 16}
!154 = !{i32 16, !155, !156, !157, !158}
!155 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!157 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!158 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!159 = !{i32 128, !160, !162}
!160 = !{i32 6, !"view_to_world", i32 2, !161, i32 3, i32 0, i32 7, i32 9}
!161 = !{i32 4, i32 4, i32 2}
!162 = !{i32 6, !"projection_to_world", i32 2, !161, i32 3, i32 64, i32 7, i32 9}
!163 = !{i32 80, !164}
!164 = !{i32 6, !"h", i32 3, i32 0}
!165 = !{i32 80, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!166 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!167 = !{i32 6, !"_pad0", i32 3, i32 12, i32 7, i32 9}
!168 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!169 = !{i32 6, !"_pad1", i32 3, i32 28, i32 7, i32 9}
!170 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!171 = !{i32 6, !"_pad2", i32 3, i32 44, i32 7, i32 9}
!172 = !{i32 6, !"bitangent", i32 3, i32 48, i32 7, i32 9}
!173 = !{i32 6, !"_pad3", i32 3, i32 60, i32 7, i32 9}
!174 = !{i32 6, !"uv", i32 3, i32 64, i32 7, i32 9}
!175 = !{i32 6, !"_pad4", i32 3, i32 72, i32 7, i32 9}
!176 = !{i32 52, !164}
!177 = !{i32 52, !178, !179, !180, !181, !182}
!178 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!179 = !{i32 6, !"reflectance", i32 3, i32 12, i32 7, i32 9}
!180 = !{i32 6, !"metallic", i32 3, i32 16, i32 7, i32 9}
!181 = !{i32 6, !"roughness", i32 3, i32 20, i32 7, i32 9}
!182 = !{i32 6, !"_pad", i32 3, i32 32, i32 7, i32 9}
!183 = !{i32 1076, !184, !185}
!184 = !{i32 6, !"point_lights", i32 3, i32 0}
!185 = !{i32 6, !"point_light_settings", i32 3, i32 320}
!186 = !{i32 32, !166, !187, !188}
!187 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9}
!188 = !{i32 6, !"intensity", i32 3, i32 28, i32 7, i32 9}
!189 = !{i32 756, !190, !191}
!190 = !{i32 6, !"count", i32 3, i32 0, i32 7, i32 4}
!191 = !{i32 6, !"_pad", i32 3, i32 16, i32 7, i32 4}
!192 = !{i32 16, !164}
!193 = !{i32 16, !194, !195, !196, !197}
!194 = !{i32 6, !"vertex_offset", i32 3, i32 0, i32 7, i32 4}
!195 = !{i32 6, !"index_offset", i32 3, i32 4, i32 7, i32 4}
!196 = !{i32 6, !"material_id", i32 3, i32 8, i32 7, i32 4}
!197 = !{i32 6, !"_pad", i32 3, i32 12, i32 7, i32 4}
!198 = !{i32 32, !199, !200, !201, !202}
!199 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!200 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!201 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!202 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!203 = !{i32 16, !204}
!204 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!205 = !{i32 8, !206}
!206 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!207 = !{i32 4, !208}
!208 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!209 = !{i32 144, !210}
!210 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!211 = !{i32 1076, !212}
!212 = !{i32 6, !"hitgroup_cb", i32 3, i32 0}
!213 = !{i32 1, void ()* @"\01?CameraRaygenShader@@YAXXZ", !214, void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !216, void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", !219, void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", !219}
!214 = !{!215}
!215 = !{i32 1, !2, !2}
!216 = !{!215, !217, !218}
!217 = !{i32 2, !2, !2}
!218 = !{i32 0, !2, !2}
!219 = !{!215, !217}
!220 = !{null, !"", null, !129, !221}
!221 = !{i32 0, i64 65552}
!222 = !{void (%struct.CameraRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?CameraClosestHitShader@@YAXUCameraRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !223}
!223 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !224}
!224 = !{i32 0}
!225 = !{void (%struct.CameraRayPayload*)* @"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", !"\01?CameraMissShader@@YAXUCameraRayPayload@@@Z", null, null, !226}
!226 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !224}
!227 = !{void ()* @"\01?CameraRaygenShader@@YAXXZ", !"\01?CameraRaygenShader@@YAXXZ", null, null, !228}
!228 = !{i32 8, i32 7, i32 5, !224}
!229 = !{void (%struct.ShadowRayPayload*)* @"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", !"\01?ShadowMissShader@@YAXUShadowRayPayload@@@Z", null, null, !230}
!230 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !224}
!231 = !DILocation(line: 103, column: 33, scope: !32)
!232 = !DILocation(line: 103, column: 63, scope: !32)
!233 = !DILocation(line: 103, column: 53, scope: !32)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !32, file: !1, line: 103, type: !4)
!235 = !DIExpression(DW_OP_bit_piece, 0, 32)
!236 = !DILocation(line: 103, column: 12, scope: !32)
!237 = !DIExpression(DW_OP_bit_piece, 32, 32)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj_dir", scope: !32, file: !1, line: 106, type: !14)
!239 = !DIExpression()
!240 = !DILocation(line: 106, column: 12, scope: !32)
!241 = !DILocation(line: 108, column: 56, scope: !32)
!242 = !DILocation(line: 108, column: 30, scope: !32)
!243 = !DILocation(line: 108, column: 5, scope: !32)
!244 = !DILocation(line: 109, column: 55, scope: !32)
!245 = !DILocation(line: 109, column: 30, scope: !32)
!246 = !DILocation(line: 109, column: 5, scope: !32)
!247 = !DILocation(line: 112, column: 47, scope: !32)
!248 = !DILocation(line: 112, column: 25, scope: !32)
!249 = !DILocation(line: 113, column: 24, scope: !32)
!250 = !DILocation(line: 113, column: 39, scope: !32)
!251 = !DILocation(line: 113, column: 38, scope: !32)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !32, file: !1, line: 113, type: !14)
!253 = !DILocation(line: 113, column: 12, scope: !32)
!254 = !DIExpression(DW_OP_bit_piece, 64, 32)
!255 = !DILocation(line: 115, column: 48, scope: !32)
!256 = !DILocation(line: 116, column: 25, scope: !32)
!257 = !DILocation(line: 116, column: 41, scope: !32)
!258 = !DILocation(line: 116, column: 40, scope: !32)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_pos", scope: !32, file: !1, line: 116, type: !14)
!260 = !DILocation(line: 116, column: 12, scope: !32)
!261 = !DILocation(line: 117, column: 44, scope: !32)
!262 = !DILocation(line: 117, column: 25, scope: !32)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_dir", scope: !32, file: !1, line: 117, type: !14)
!264 = !DILocation(line: 117, column: 12, scope: !32)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 127, type: !45)
!266 = !DILocation(line: 127, column: 22, scope: !32)
!267 = !DILocation(line: 128, column: 5, scope: !32)
!268 = !DILocation(line: 131, column: 5, scope: !32)
!269 = !DILocation(line: 131, column: 42, scope: !32)
!270 = !DILocation(line: 132, column: 1, scope: !32)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !41, file: !1, line: 143, type: !48)
!272 = !DIExpression(DW_OP_deref)
!273 = !DILocation(line: 143, column: 77, scope: !41)
!274 = !DILocation(line: 145, column: 24, scope: !41)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_id", scope: !41, file: !1, line: 145, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 145, baseType: !66)
!277 = !DILocation(line: 145, column: 10, scope: !41)
!278 = !DILocation(line: 146, column: 25, scope: !41)
!279 = !DILocation(line: 146, column: 54, scope: !41)
!280 = !DILocation(line: 152, column: 12, scope: !41)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vertex_offset", scope: !41, file: !1, line: 146, type: !13)
!282 = !DILocation(line: 146, column: 9, scope: !41)
!283 = !DILocation(line: 147, column: 53, scope: !41)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index_offset", scope: !41, file: !1, line: 147, type: !13)
!285 = !DILocation(line: 147, column: 9, scope: !41)
!286 = !DILocation(line: 150, column: 17, scope: !41)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pidx", scope: !41, file: !1, line: 150, type: !276)
!288 = !DILocation(line: 150, column: 10, scope: !41)
!289 = !DILocation(line: 151, column: 41, scope: !41)
!290 = !DILocation(line: 151, column: 43, scope: !41)
!291 = !DILocation(line: 151, column: 57, scope: !41)
!292 = !DILocation(line: 151, column: 17, scope: !41)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !41, file: !1, line: 151, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 151, baseType: !295)
!295 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 151, size: 96, align: 32, elements: !296, templateParams: !300)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !295, file: !1, line: 151, baseType: !66, size: 32, align: 32, flags: DIFlagPublic)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !295, file: !1, line: 151, baseType: !66, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !295, file: !1, line: 151, baseType: !66, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!300 = !{!301, !21}
!301 = !DITemplateTypeParameter(name: "element", type: !66)
!302 = !DILocation(line: 151, column: 11, scope: !41)
!303 = !DILocation(line: 152, column: 9, scope: !41)
!304 = !DILocation(line: 155, column: 17, scope: !41)
!305 = !DILocation(line: 155, column: 38, scope: !41)
!306 = !DILocation(line: 156, column: 38, scope: !41)
!307 = !DILocation(line: 157, column: 38, scope: !41)
!308 = !DILocation(line: 158, column: 49, scope: !41)
!309 = !{!310, !310, i64 0}
!310 = !{!"omnipotent char", !311, i64 0}
!311 = !{!"Simple C/C++ TBAA"}
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barycentrics", arg: 4, scope: !35, file: !1, line: 134, type: !4)
!313 = !DILocation(line: 134, column: 78, scope: !35, inlinedAt: !314)
!314 = distinct !DILocation(line: 158, column: 17, scope: !41)
!315 = !DILocation(line: 135, column: 15, scope: !35, inlinedAt: !314)
!316 = !DILocation(line: 135, column: 33, scope: !35, inlinedAt: !314)
!317 = !DILocation(line: 135, column: 29, scope: !35, inlinedAt: !314)
!318 = !DILocation(line: 135, column: 14, scope: !35, inlinedAt: !314)
!319 = !DILocation(line: 135, column: 38, scope: !35, inlinedAt: !314)
!320 = !DILocation(line: 135, column: 56, scope: !35, inlinedAt: !314)
!321 = !DILocation(line: 135, column: 52, scope: !35, inlinedAt: !314)
!322 = !DILocation(line: 135, column: 37, scope: !35, inlinedAt: !314)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ni", scope: !41, file: !1, line: 158, type: !14)
!324 = !DILocation(line: 158, column: 12, scope: !41)
!325 = !DILocation(line: 159, column: 31, scope: !41)
!326 = !DILocation(line: 159, column: 27, scope: !41)
!327 = !DILocation(line: 139, column: 12, scope: !38, inlinedAt: !328)
!328 = distinct !DILocation(line: 162, column: 24, scope: !41)
!329 = !DILocation(line: 139, column: 29, scope: !38, inlinedAt: !328)
!330 = !DILocation(line: 139, column: 49, scope: !38, inlinedAt: !328)
!331 = !DILocation(line: 139, column: 48, scope: !38, inlinedAt: !328)
!332 = !DILocation(line: 139, column: 28, scope: !38, inlinedAt: !328)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !41, file: !1, line: 162, type: !14)
!334 = !DILocation(line: 162, column: 12, scope: !41)
!335 = !DILocation(line: 165, column: 16, scope: !41)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !41, file: !1, line: 165, type: !14)
!337 = !DILocation(line: 165, column: 12, scope: !41)
!338 = !DILocation(line: 166, column: 42, scope: !41)
!339 = !DILocation(line: 166, column: 16, scope: !41)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !41, file: !1, line: 166, type: !14)
!341 = !DILocation(line: 166, column: 12, scope: !41)
!342 = !DILocation(line: 169, column: 18, scope: !41)
!343 = !DILocation(line: 169, column: 47, scope: !41)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat_id", scope: !41, file: !1, line: 169, type: !13)
!345 = !DILocation(line: 169, column: 9, scope: !41)
!346 = !DILocation(line: 170, column: 21, scope: !41)
!347 = !DILocation(line: 170, column: 45, scope: !41)
!348 = !DILocation(line: 171, column: 49, scope: !41)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reflectance", scope: !41, file: !1, line: 171, type: !8)
!350 = !DILocation(line: 171, column: 11, scope: !41)
!351 = !DILocation(line: 172, column: 46, scope: !41)
!352 = !DILocation(line: 211, column: 72, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !1, line: 176, column: 84)
!354 = distinct !DILexicalBlock(scope: !355, file: !1, line: 176, column: 5)
!355 = distinct !DILexicalBlock(scope: !41, file: !1, line: 176, column: 5)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "metallic", scope: !41, file: !1, line: 172, type: !8)
!357 = !DILocation(line: 172, column: 11, scope: !41)
