#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: d473289993ea22d0ad7f841bec833ace.pdb
; shader hash: d473289993ea22d0ad7f841bec833ace
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.PerspectiveCamera
;           {
;
;               column_major float4x4 view_to_world;  ; Offset:   16
;               column_major float4x4 projection_to_world;; Offset:   80
;           
;           } camera;                                 ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:   144
;
; }
;
; cbuffer hitgroup_cb
; {
;
;   struct hitgroup_cb
;   {
;
;       struct struct.HitGroupConstantBuffer
;       {
;
;           struct struct.PointLight
;           {
;
;               float4 position;                      ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !55)
!1 = !DIFile(filename: "D:/Code/rally/rally/render/shaders/shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 86, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 86, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 89, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 89, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 89, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 95, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 95, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 95, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !35, !38, !41, !52}
!32 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 84, type: !33, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "InterpolateFloat3", linkageName: "\01?InterpolateFloat3@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 117, type: !36, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!14, !14, !14, !14, !4}
!38 = !DISubprogram(name: "GetWorldPos", linkageName: "\01?GetWorldPos@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 121, type: !39, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!14}
!41 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 126, type: !42, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !48}
!44 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 78, size: 128, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !45, file: !1, line: 80, baseType: !22, size: 128, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 77, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 123, size: 64, align: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !49, file: !1, line: 123, baseType: !5, size: 64, align: 32)
!52 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 168, type: !53, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !44}
!55 = !{!56, !59, !61, !65, !81, !83}
!56 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 111, type: !57, isLocal: true, isDefinition: true, variable: i32 16)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 63, type: !60, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 63, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 64, type: !62, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 64, size: 128, align: 32, elements: !2, templateParams: !63)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "element", type: !23)
!65 = !DIGlobalVariable(name: "vertex_buffer", linkageName: "\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 70, type: !66, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A")
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 70, size: 640, align: 32, elements: !2, templateParams: !67)
!67 = !{!68}
!68 = !DITemplateTypeParameter(name: "element", type: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 26, size: 640, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !69, file: !1, line: 28, baseType: !14, size: 96, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !69, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !69, file: !1, line: 30, baseType: !14, size: 96, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !69, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !69, file: !1, line: 32, baseType: !14, size: 96, align: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !69, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !69, file: !1, line: 34, baseType: !14, size: 96, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pad3", scope: !69, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 480)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !69, file: !1, line: 36, baseType: !4, size: 64, align: 32, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_pad4", scope: !69, file: !1, line: 37, baseType: !4, size: 64, align: 32, offset: 576)
!81 = !DIGlobalVariable(name: "index_buffer", linkageName: "\01?index_buffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 71, type: !82, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 71, size: 32, align: 32, elements: !2)
!83 = !DIGlobalVariable(name: "material_buffer", linkageName: "\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 72, type: !84, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A")
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 72, size: 128, align: 32, elements: !2, templateParams: !85)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "element", type: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 40, size: 128, align: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !87, file: !1, line: 42, baseType: !14, size: 96, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !87, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 96)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"dxc 1.2"}
!94 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define MAX_POINT_LIGHTS 10\0D\0A\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct PerspectiveCamera\0D\0A{\0D\0A    float4x4 view_to_world;\0D\0A    float4x4 projection_to_world;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    PerspectiveCamera camera;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float _pad0;\0D\0A    float3 normal;\0D\0A    float _pad1;\0D\0A    float3 tangent;\0D\0A    float _pad2;\0D\0A    float3 bitangent;\0D\0A    float _pad3;\0D\0A    float2 uv;\0D\0A    float2 _pad4;\0D\0A};\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 albedo;\0D\0A    float shininess;\0D\0A};\0D\0A\0D\0Astruct PointLight\0D\0A{\0D\0A    float4 position;\0D\0A    float3 color;\0D\0A    float intensity;\0D\0A};\0D\0A\0D\0Astruct PointLightSettings{\0D\0A    int count;\0D\0A};\0D\0A\0D\0Astruct HitGroupConstantBuffer{\0D\0A    PointLight point_lights[MAX_POINT_LIGHTS];\0D\0A    PointLightSettings point_light_settings;\0D\0A};\0D\0A\0D\0A// Global DXR descriptors\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0A\0D\0A// Local Raygen Constant Buffer\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0A// Global Descriptor Table\0D\0AStructuredBuffer<Vertex> vertex_buffer: register(t1, space0);\0D\0AByteAddressBuffer index_buffer : register(t2, space0);\0D\0AStructuredBuffer<Material> material_buffer : register(t3, space0);\0D\0A\0D\0A// Local Hit Group Descriptor Table\0D\0AConstantBuffer<HitGroupConstantBuffer> hitgroup_cb : register(b2);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2)DispatchRaysIndex() / (float2)DispatchRaysDimensions();\0D\0A\0D\0A    // Start with projection space coords and direction\0D\0A    float3 proj_dir = float3(0, 0, 1);\0D\0A    float3 proj_origin = float3(\0D\0A    lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A    lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A    0.0f);\0D\0A    // Move to world space\0D\0A    float4 world_pos4 = mul(g_rayGenCB.camera.projection_to_world,float4(proj_origin,1.0f));\0D\0A    float3 world_pos = world_pos4.xyz/world_pos4.w;\0D\0A    // Camera position\0D\0A    float4 camera_pos4 = mul(g_rayGenCB.camera.view_to_world,float4(0.0f,0.0f,0.0f,1.0f));\0D\0A    float3 camera_pos = camera_pos4.xyz/camera_pos4.w;\0D\0A    float3 camera_dir = normalize(world_pos-camera_pos);\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera_pos;\0D\0A    ray.Direction = camera_dir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0Afloat3 InterpolateFloat3(in float3 a0, in float3 a1, in float3 a2, in float2 barycentrics){\0D\0A    return a0+barycentrics.x*(a1-a0)+barycentrics.y*(a2-a0);\0D\0A}\0D\0A\0D\0Afloat3 GetWorldPos(){\0D\0A    return WorldRayOrigin()+WorldRayDirection()*RayTCurrent();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    uint pidx = PrimitiveIndex();\0D\0A    uint3 idx = index_buffer.Load3(pidx*3*4);\0D\0A    \0D\0A    // Get normal\0D\0A    float3 n0 = vertex_buffer[idx.x].normal;\0D\0A    float3 n1 = vertex_buffer[idx.y].normal;\0D\0A    float3 n2 = vertex_buffer[idx.z].normal;\0D\0A    float3 ni = InterpolateFloat3(n0,n1,n2,attr.barycentrics);\0D\0A    float3 world_normal = mul(ObjectToWorld3x4(),float4(ni,0.0f));\0D\0A\0D\0A    // Get world pos\0D\0A    float3 world_pos = GetWorldPos();\0D\0A    \0D\0A    uint mat_id = InstanceID();\0D\0A    float3 world_camera_pos = WorldRayOrigin();\0D\0A    float3 albedo_color = material_buffer[mat_id].albedo;\0D\0A    float k_a = 0.1f;\0D\0A    float k_d = 0.45f;\0D\0A    float k_s = 0.45f;\0D\0A    float shininess = material_buffer[mat_id].shininess;\0D\0A    float3 N = normalize(world_normal);\0D\0A    float3 V = normalize(world_camera_pos-world_pos);\0D\0A    \0D\0A    float3 phong = k_a*albedo_color;\0D\0A    for(int light_i = 0; light_i<hitgroup_cb.point_light_settings.count; light_i++){\0D\0A        PointLight point_light = hitgroup_cb.point_lights[light_i];\0D\0A        float3 world_light_pos = point_light.position.xyz;\0D\0A        float3 world_light_dir = world_light_pos-world_pos;\0D\0A        float light_dist = length(world_light_dir);\0D\0A        float light_att = clamp(point_light.intensity/light_dist,0.0f,1.0f);\0D\0A        float3 L = normalize(world_light_dir);\0D\0A        float3 R = normalize(reflect(-L,N));\0D\0A        phong += light_att*k_d*max(dot(N,L),0.0f)*albedo_color*point_light.color;\0D\0A        phong += light_att*k_s*max(pow(dot(R,V),shininess),0.0f)*albedo_color*point_light.color;\0D\0A    }\0D\0A    payload.color = float4(phong, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!95 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl"}
!96 = !{!"-T", !"lib_6_3", !"-Zi", !"-Qembed_debug"}
!97 = !{i32 1, i32 3}
!98 = !{i32 1, i32 5}
!99 = !{!"lib", i32 6, i32 3}
!100 = !{!101, !109, !112, null}
!101 = !{!102, !104, !106, !107}
!102 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !103}
!103 = !{i32 0, i32 4}
!104 = !{i32 1, %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", !"vertex_buffer", i32 0, i32 1, i32 1, i32 12, i32 0, !105}
!105 = !{i32 1, i32 80}
!106 = !{i32 2, %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A", !"index_buffer", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!107 = !{i32 3, %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", !"material_buffer", i32 0, i32 3, i32 1, i32 12, i32 0, !108}
!108 = !{i32 1, i32 16}
!109 = !{!110}
!110 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !111}
!111 = !{i32 0, i32 9}
!112 = !{!113, !114}
!113 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 144, null}
!114 = !{i32 1, %hitgroup_cb* @hitgroup_cb, !"hitgroup_cb", i32 0, i32 2, i32 1, i32 324, null}
!115 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !116, %"class.RWTexture2D<vector<float, 4> >" undef, !118, %struct.RayGenConstantBuffer undef, !120, %struct.Viewport undef, !123, %struct.PerspectiveCamera undef, !128, %"class.StructuredBuffer<Vertex>" undef, !132, %struct.Vertex undef, !134, %struct.ByteAddressBuffer undef, !116, %"class.StructuredBuffer<Material>" undef, !145, %struct.Material undef, !146, %struct.HitGroupConstantBuffer undef, !149, %struct.PointLight undef, !152, %struct.PointLightSettings undef, !155, %struct.RayDesc undef, !157, %struct.RayPayload undef, !162, %struct.BuiltInTriangleIntersectionAttributes undef, !164, %g_rayGenCB undef, !166, %hitgroup_cb undef, !168}
!116 = !{i32 4, !117}
!117 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!118 = !{i32 16, !119}
!119 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!120 = !{i32 144, !121, !122}
!121 = !{i32 6, !"viewport", i32 3, i32 0}
!122 = !{i32 6, !"camera", i32 3, i32 16}
!123 = !{i32 16, !124, !125, !126, !127}
!124 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!125 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!126 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!127 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!128 = !{i32 128, !129, !131}
!129 = !{i32 6, !"view_to_world", i32 2, !130, i32 3, i32 0, i32 7, i32 9}
!130 = !{i32 4, i32 4, i32 2}
!131 = !{i32 6, !"projection_to_world", i32 2, !130, i32 3, i32 64, i32 7, i32 9}
!132 = !{i32 80, !133}
!133 = !{i32 6, !"h", i32 3, i32 0}
!134 = !{i32 80, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!135 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!136 = !{i32 6, !"_pad0", i32 3, i32 12, i32 7, i32 9}
!137 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!138 = !{i32 6, !"_pad1", i32 3, i32 28, i32 7, i32 9}
!139 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!140 = !{i32 6, !"_pad2", i32 3, i32 44, i32 7, i32 9}
!141 = !{i32 6, !"bitangent", i32 3, i32 48, i32 7, i32 9}
!142 = !{i32 6, !"_pad3", i32 3, i32 60, i32 7, i32 9}
!143 = !{i32 6, !"uv", i32 3, i32 64, i32 7, i32 9}
!144 = !{i32 6, !"_pad4", i32 3, i32 72, i32 7, i32 9}
!145 = !{i32 16, !133}
!146 = !{i32 16, !147, !148}
!147 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!148 = !{i32 6, !"shininess", i32 3, i32 12, i32 7, i32 9}
!149 = !{i32 324, !150, !151}
!150 = !{i32 6, !"point_lights", i32 3, i32 0}
!151 = !{i32 6, !"point_light_settings", i32 3, i32 320}
!152 = !{i32 32, !135, !153, !154}
!153 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9}
!154 = !{i32 6, !"intensity", i32 3, i32 28, i32 7, i32 9}
!155 = !{i32 4, !156}
!156 = !{i32 6, !"count", i32 3, i32 0, i32 7, i32 4}
!157 = !{i32 32, !158, !159, !160, !161}
!158 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!159 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!160 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!161 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!162 = !{i32 16, !163}
!163 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 8, !165}
!165 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!166 = !{i32 144, !167}
!167 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!168 = !{i32 324, !169}
!169 = !{i32 6, !"hitgroup_cb", i32 3, i32 0}
!170 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !171, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !176}
!171 = !{!172}
!172 = !{i32 1, !2, !2}
!173 = !{!172, !174, !175}
!174 = !{i32 2, !2, !2}
!175 = !{i32 0, !2, !2}
!176 = !{!172, !174}
!177 = !{null, !"", null, !100, !178}
!178 = !{i32 0, i64 65552}
!179 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !180}
!180 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !181}
!181 = !{i32 0}
!182 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !183}
!183 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !181}
!184 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !185}
!185 = !{i32 8, i32 7, i32 5, !181}
!186 = !DILocation(line: 86, column: 33, scope: !32)
!187 = !DILocation(line: 86, column: 63, scope: !32)
!188 = !DILocation(line: 86, column: 53, scope: !32)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !32, file: !1, line: 86, type: !4)
!190 = !DIExpression(DW_OP_bit_piece, 0, 32)
!191 = !DILocation(line: 86, column: 12, scope: !32)
!192 = !DIExpression(DW_OP_bit_piece, 32, 32)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj_dir", scope: !32, file: !1, line: 89, type: !14)
!194 = !DIExpression()
!195 = !DILocation(line: 89, column: 12, scope: !32)
!196 = !DILocation(line: 91, column: 56, scope: !32)
!197 = !DILocation(line: 91, column: 30, scope: !32)
!198 = !DILocation(line: 91, column: 5, scope: !32)
!199 = !DILocation(line: 92, column: 55, scope: !32)
!200 = !DILocation(line: 92, column: 30, scope: !32)
!201 = !DILocation(line: 92, column: 5, scope: !32)
!202 = !DILocation(line: 95, column: 47, scope: !32)
!203 = !DILocation(line: 95, column: 25, scope: !32)
!204 = !DILocation(line: 96, column: 24, scope: !32)
!205 = !DILocation(line: 96, column: 39, scope: !32)
!206 = !DILocation(line: 96, column: 38, scope: !32)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !32, file: !1, line: 96, type: !14)
!208 = !DILocation(line: 96, column: 12, scope: !32)
!209 = !DIExpression(DW_OP_bit_piece, 64, 32)
!210 = !DILocation(line: 98, column: 48, scope: !32)
!211 = !DILocation(line: 99, column: 25, scope: !32)
!212 = !DILocation(line: 99, column: 41, scope: !32)
!213 = !DILocation(line: 99, column: 40, scope: !32)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_pos", scope: !32, file: !1, line: 99, type: !14)
!215 = !DILocation(line: 99, column: 12, scope: !32)
!216 = !DILocation(line: 100, column: 44, scope: !32)
!217 = !DILocation(line: 100, column: 25, scope: !32)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_dir", scope: !32, file: !1, line: 100, type: !14)
!219 = !DILocation(line: 100, column: 12, scope: !32)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 110, type: !45)
!221 = !DILocation(line: 110, column: 16, scope: !32)
!222 = !DILocation(line: 111, column: 5, scope: !32)
!223 = !DILocation(line: 114, column: 5, scope: !32)
!224 = !DILocation(line: 114, column: 42, scope: !32)
!225 = !DILocation(line: 115, column: 1, scope: !32)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !41, file: !1, line: 126, type: !48)
!227 = !DIExpression(DW_OP_deref)
!228 = !DILocation(line: 126, column: 67, scope: !41)
!229 = !DILocation(line: 129, column: 17, scope: !41)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pidx", scope: !41, file: !1, line: 129, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 129, baseType: !58)
!232 = !DILocation(line: 129, column: 10, scope: !41)
!233 = !DILocation(line: 130, column: 42, scope: !41)
!234 = !DILocation(line: 130, column: 17, scope: !41)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !41, file: !1, line: 130, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 130, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 130, size: 96, align: 32, elements: !238, templateParams: !242)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !237, file: !1, line: 130, baseType: !58, size: 32, align: 32, flags: DIFlagPublic)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !237, file: !1, line: 130, baseType: !58, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !237, file: !1, line: 130, baseType: !58, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!242 = !{!243, !21}
!243 = !DITemplateTypeParameter(name: "element", type: !58)
!244 = !DILocation(line: 130, column: 11, scope: !41)
!245 = !DILocation(line: 133, column: 17, scope: !41)
!246 = !DILocation(line: 133, column: 38, scope: !41)
!247 = !DILocation(line: 134, column: 38, scope: !41)
!248 = !DILocation(line: 135, column: 38, scope: !41)
!249 = !DILocation(line: 136, column: 49, scope: !41)
!250 = !{!251, !251, i64 0}
!251 = !{!"omnipotent char", !252, i64 0}
!252 = !{!"Simple C/C++ TBAA"}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barycentrics", arg: 4, scope: !35, file: !1, line: 117, type: !4)
!254 = !DILocation(line: 117, column: 78, scope: !35, inlinedAt: !255)
!255 = distinct !DILocation(line: 136, column: 17, scope: !41)
!256 = !DILocation(line: 118, column: 15, scope: !35, inlinedAt: !255)
!257 = !DILocation(line: 118, column: 33, scope: !35, inlinedAt: !255)
!258 = !DILocation(line: 118, column: 29, scope: !35, inlinedAt: !255)
!259 = !DILocation(line: 118, column: 14, scope: !35, inlinedAt: !255)
!260 = !DILocation(line: 118, column: 38, scope: !35, inlinedAt: !255)
!261 = !DILocation(line: 118, column: 56, scope: !35, inlinedAt: !255)
!262 = !DILocation(line: 118, column: 52, scope: !35, inlinedAt: !255)
!263 = !DILocation(line: 118, column: 37, scope: !35, inlinedAt: !255)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ni", scope: !41, file: !1, line: 136, type: !14)
!265 = !DILocation(line: 136, column: 12, scope: !41)
!266 = !DILocation(line: 137, column: 31, scope: !41)
!267 = !DILocation(line: 137, column: 27, scope: !41)
!268 = !DILocation(line: 122, column: 12, scope: !38, inlinedAt: !269)
!269 = distinct !DILocation(line: 140, column: 24, scope: !41)
!270 = !DILocation(line: 122, column: 29, scope: !38, inlinedAt: !269)
!271 = !DILocation(line: 122, column: 49, scope: !38, inlinedAt: !269)
!272 = !DILocation(line: 122, column: 48, scope: !38, inlinedAt: !269)
!273 = !DILocation(line: 122, column: 28, scope: !38, inlinedAt: !269)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !41, file: !1, line: 140, type: !14)
!275 = !DILocation(line: 140, column: 12, scope: !41)
!276 = !DILocation(line: 142, column: 19, scope: !41)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat_id", scope: !41, file: !1, line: 142, type: !231)
!278 = !DILocation(line: 142, column: 10, scope: !41)
!279 = !DILocation(line: 144, column: 27, scope: !41)
!280 = !DILocation(line: 144, column: 51, scope: !41)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_a", scope: !41, file: !1, line: 145, type: !8)
!282 = !DILocation(line: 145, column: 11, scope: !41)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_d", scope: !41, file: !1, line: 146, type: !8)
!284 = !DILocation(line: 146, column: 11, scope: !41)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_s", scope: !41, file: !1, line: 147, type: !8)
!286 = !DILocation(line: 147, column: 11, scope: !41)
!287 = !DILocation(line: 148, column: 47, scope: !41)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shininess", scope: !41, file: !1, line: 148, type: !8)
!289 = !DILocation(line: 148, column: 11, scope: !41)
!290 = !DILocation(line: 149, column: 16, scope: !41)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !41, file: !1, line: 149, type: !14)
!292 = !DILocation(line: 149, column: 12, scope: !41)
!293 = !DILocation(line: 150, column: 42, scope: !41)
!294 = !DILocation(line: 150, column: 16, scope: !41)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !41, file: !1, line: 150, type: !14)
!296 = !DILocation(line: 150, column: 12, scope: !41)
!297 = !DILocation(line: 152, column: 23, scope: !41)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phong", scope: !41, file: !1, line: 152, type: !14)
