#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: d4d46c55572b8fdf5255a3796d8b2f3f.pdb
; shader hash: d4d46c55572b8fdf5255a3796d8b2f3f
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.PerspectiveCamera
;           {
;
;               column_major float4x4 view_to_world;  ; Offset:   16
;               column_major float4x4 projection_to_world;; Offset:   80
;           
;           } camera;                                 ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:   144
;
; }
;
; cbuffer hitgroup_cb
; {
;
;   struct hitgroup_cb
;   {
;
;       struct struct.HitGroupConstantBuffer
;       {
;
;           struct struct.PointLight
;           {
;
;               float4 position;                      ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !55)
!1 = !DIFile(filename: "D:/Code/rally/rally/render/shaders/shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 95, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 95, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 98, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 98, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 98, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 104, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !35, !38, !41, !52}
!32 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 93, type: !33, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "InterpolateFloat3", linkageName: "\01?InterpolateFloat3@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 126, type: !36, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!14, !14, !14, !14, !4}
!38 = !DISubprogram(name: "GetWorldPos", linkageName: "\01?GetWorldPos@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 130, type: !39, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!14}
!41 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 135, type: !42, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !48}
!44 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 87, size: 128, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !45, file: !1, line: 89, baseType: !22, size: 128, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 86, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 132, size: 64, align: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !49, file: !1, line: 132, baseType: !5, size: 64, align: 32)
!52 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 182, type: !53, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !44}
!55 = !{!56, !59, !61, !65, !81, !83, !91}
!56 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 120, type: !57, isLocal: true, isDefinition: true, variable: i32 16)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 71, type: !60, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 71, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 72, type: !62, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 72, size: 128, align: 32, elements: !2, templateParams: !63)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "element", type: !23)
!65 = !DIGlobalVariable(name: "vertex_buffer", linkageName: "\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 78, type: !66, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A")
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 78, size: 640, align: 32, elements: !2, templateParams: !67)
!67 = !{!68}
!68 = !DITemplateTypeParameter(name: "element", type: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 26, size: 640, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !69, file: !1, line: 28, baseType: !14, size: 96, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !69, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !69, file: !1, line: 30, baseType: !14, size: 96, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !69, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !69, file: !1, line: 32, baseType: !14, size: 96, align: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !69, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !69, file: !1, line: 34, baseType: !14, size: 96, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pad3", scope: !69, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 480)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !69, file: !1, line: 36, baseType: !4, size: 64, align: 32, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_pad4", scope: !69, file: !1, line: 37, baseType: !4, size: 64, align: 32, offset: 576)
!81 = !DIGlobalVariable(name: "index_buffer", linkageName: "\01?index_buffer@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 79, type: !82, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 79, size: 32, align: 32, elements: !2)
!83 = !DIGlobalVariable(name: "material_buffer", linkageName: "\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 80, type: !84, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A")
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 80, size: 128, align: 32, elements: !2, templateParams: !85)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "element", type: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 40, size: 128, align: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !87, file: !1, line: 42, baseType: !14, size: 96, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !87, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 96)
!91 = !DIGlobalVariable(name: "instance_buffer", linkageName: "\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", scope: !0, file: !1, line: 84, type: !92, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A")
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceBuffer>", file: !1, line: 84, size: 128, align: 32, elements: !2, templateParams: !93)
!93 = !{!94}
!94 = !DITemplateTypeParameter(name: "element", type: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceBuffer", file: !1, line: 63, size: 128, align: 32, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_offset", scope: !95, file: !1, line: 64, baseType: !13, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "index_offset", scope: !95, file: !1, line: 65, baseType: !13, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "material_id", scope: !95, file: !1, line: 66, baseType: !13, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !95, file: !1, line: 67, baseType: !13, size: 32, align: 32, offset: 96)
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{!"dxc 1.2"}
!104 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define MAX_POINT_LIGHTS 10\0D\0A\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct PerspectiveCamera\0D\0A{\0D\0A    float4x4 view_to_world;\0D\0A    float4x4 projection_to_world;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    PerspectiveCamera camera;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 position;\0D\0A    float _pad0;\0D\0A    float3 normal;\0D\0A    float _pad1;\0D\0A    float3 tangent;\0D\0A    float _pad2;\0D\0A    float3 bitangent;\0D\0A    float _pad3;\0D\0A    float2 uv;\0D\0A    float2 _pad4;\0D\0A};\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 albedo;\0D\0A    float shininess;\0D\0A};\0D\0A\0D\0Astruct PointLight\0D\0A{\0D\0A    float4 position;\0D\0A    float3 color;\0D\0A    float intensity;\0D\0A};\0D\0A\0D\0Astruct PointLightSettings{\0D\0A    int count;\0D\0A    int _pad[47];\0D\0A};\0D\0A\0D\0Astruct HitGroupConstantBuffer{\0D\0A    PointLight point_lights[MAX_POINT_LIGHTS];\0D\0A    PointLightSettings point_light_settings;\0D\0A};\0D\0A\0D\0Astruct InstanceBuffer{\0D\0A    int vertex_offset;\0D\0A    int index_offset;\0D\0A    int material_id;\0D\0A    int _pad;\0D\0A};\0D\0A\0D\0A// Global DXR descriptors\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0A\0D\0A// Local Raygen Constant Buffer\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0A// Global Descriptor Table\0D\0AStructuredBuffer<Vertex> vertex_buffer: register(t1, space0);\0D\0AByteAddressBuffer index_buffer : register(t2, space0);\0D\0AStructuredBuffer<Material> material_buffer : register(t3, space0);\0D\0A\0D\0A// Local Hit Group Descriptor Table\0D\0AConstantBuffer<HitGroupConstantBuffer> hitgroup_cb : register(b1);\0D\0AStructuredBuffer<InstanceBuffer> instance_buffer : register(t4, space0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2)DispatchRaysIndex() / (float2)DispatchRaysDimensions();\0D\0A\0D\0A    // Start with projection space coords and direction\0D\0A    float3 proj_dir = float3(0, 0, 1);\0D\0A    float3 proj_origin = float3(\0D\0A    lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A    lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A    0.0f);\0D\0A    // Move to world space\0D\0A    float4 world_pos4 = mul(g_rayGenCB.camera.projection_to_world,float4(proj_origin,1.0f));\0D\0A    float3 world_pos = world_pos4.xyz/world_pos4.w;\0D\0A    // Camera position\0D\0A    float4 camera_pos4 = mul(g_rayGenCB.camera.view_to_world,float4(0.0f,0.0f,0.0f,1.0f));\0D\0A    float3 camera_pos = camera_pos4.xyz/camera_pos4.w;\0D\0A    float3 camera_dir = normalize(world_pos-camera_pos);\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera_pos;\0D\0A    ray.Direction = camera_dir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0Afloat3 InterpolateFloat3(in float3 a0, in float3 a1, in float3 a2, in float2 barycentrics){\0D\0A    return a0+barycentrics.x*(a1-a0)+barycentrics.y*(a2-a0);\0D\0A}\0D\0A\0D\0Afloat3 GetWorldPos(){\0D\0A    return WorldRayOrigin()+WorldRayDirection()*RayTCurrent();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint instance_id = InstanceID();\0D\0A    int vertex_offset = instance_buffer[instance_id].vertex_offset;\0D\0A    int index_offset = instance_buffer[instance_id].index_offset;\0D\0A\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    uint pidx = PrimitiveIndex();\0D\0A    uint3 idx = index_buffer.Load3((pidx*3+index_offset)*4);\0D\0A    idx += vertex_offset;\0D\0A    \0D\0A    // Get normal\0D\0A    float3 n0 = vertex_buffer[idx.x].normal;\0D\0A    float3 n1 = vertex_buffer[idx.y].normal;\0D\0A    float3 n2 = vertex_buffer[idx.z].normal;\0D\0A    float3 ni = InterpolateFloat3(n0,n1,n2,attr.barycentrics);\0D\0A    float3 world_normal = mul(ObjectToWorld3x4(),float4(ni,0.0f));\0D\0A\0D\0A    // Get world pos\0D\0A    float3 world_pos = GetWorldPos();\0D\0A    \0D\0A    int mat_id = instance_buffer[instance_id].material_id;\0D\0A    float3 world_camera_pos = WorldRayOrigin();\0D\0A    float3 albedo_color = material_buffer[mat_id].albedo;\0D\0A    float k_a = 0.1f;\0D\0A    float k_d = 0.45f;\0D\0A    float k_s = 0.45f;\0D\0A    float shininess = material_buffer[mat_id].shininess;\0D\0A    float3 N = normalize(world_normal);\0D\0A    float3 V = normalize(world_camera_pos-world_pos);\0D\0A    \0D\0A    float3 phong = k_a*albedo_color;\0D\0A    for(int light_i = 0; light_i<hitgroup_cb.point_light_settings.count; light_i++){\0D\0A        PointLight point_light = hitgroup_cb.point_lights[light_i];\0D\0A        float3 world_light_pos = point_light.position.xyz;\0D\0A        float3 world_light_dir = world_light_pos-world_pos;\0D\0A        float light_dist = length(world_light_dir);\0D\0A        float light_att = clamp(point_light.intensity/light_dist,0.0f,1.0f);\0D\0A        float3 L = normalize(world_light_dir);\0D\0A        float3 R = normalize(reflect(-L,N));\0D\0A        phong += light_att*k_d*max(dot(N,L),0.0f)*albedo_color*point_light.color;\0D\0A        phong += light_att*k_s*max(pow(dot(R,V),shininess),0.0f)*albedo_color*point_light.color;\0D\0A    }\0D\0A    payload.color = float4(phong, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!105 = !{!"D:/Code/rally/rally/render/shaders/shader.hlsl"}
!106 = !{!"-T", !"lib_6_3", !"-Zi", !"-Qembed_debug"}
!107 = !{i32 1, i32 3}
!108 = !{i32 1, i32 5}
!109 = !{!"lib", i32 6, i32 3}
!110 = !{!111, !120, !123, null}
!111 = !{!112, !114, !116, !117, !119}
!112 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !113}
!113 = !{i32 0, i32 4}
!114 = !{i32 1, %"class.StructuredBuffer<Vertex>"* @"\01?vertex_buffer@@3V?$StructuredBuffer@UVertex@@@@A", !"vertex_buffer", i32 0, i32 1, i32 1, i32 12, i32 0, !115}
!115 = !{i32 1, i32 80}
!116 = !{i32 2, %struct.ByteAddressBuffer* @"\01?index_buffer@@3UByteAddressBuffer@@A", !"index_buffer", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!117 = !{i32 3, %"class.StructuredBuffer<Material>"* @"\01?material_buffer@@3V?$StructuredBuffer@UMaterial@@@@A", !"material_buffer", i32 0, i32 3, i32 1, i32 12, i32 0, !118}
!118 = !{i32 1, i32 16}
!119 = !{i32 4, %"class.StructuredBuffer<InstanceBuffer>"* @"\01?instance_buffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", !"instance_buffer", i32 0, i32 4, i32 1, i32 12, i32 0, !118}
!120 = !{!121}
!121 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !122}
!122 = !{i32 0, i32 9}
!123 = !{!124, !125}
!124 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 144, null}
!125 = !{i32 1, %hitgroup_cb* @hitgroup_cb, !"hitgroup_cb", i32 0, i32 1, i32 1, i32 1076, null}
!126 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !127, %"class.RWTexture2D<vector<float, 4> >" undef, !129, %struct.RayGenConstantBuffer undef, !131, %struct.Viewport undef, !134, %struct.PerspectiveCamera undef, !139, %"class.StructuredBuffer<Vertex>" undef, !143, %struct.Vertex undef, !145, %struct.ByteAddressBuffer undef, !127, %"class.StructuredBuffer<Material>" undef, !156, %struct.Material undef, !157, %struct.HitGroupConstantBuffer undef, !160, %struct.PointLight undef, !163, %struct.PointLightSettings undef, !166, %"class.StructuredBuffer<InstanceBuffer>" undef, !156, %struct.InstanceBuffer undef, !169, %struct.RayDesc undef, !174, %struct.RayPayload undef, !179, %struct.BuiltInTriangleIntersectionAttributes undef, !181, %g_rayGenCB undef, !183, %hitgroup_cb undef, !185}
!127 = !{i32 4, !128}
!128 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!129 = !{i32 16, !130}
!130 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!131 = !{i32 144, !132, !133}
!132 = !{i32 6, !"viewport", i32 3, i32 0}
!133 = !{i32 6, !"camera", i32 3, i32 16}
!134 = !{i32 16, !135, !136, !137, !138}
!135 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!136 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!137 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!138 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!139 = !{i32 128, !140, !142}
!140 = !{i32 6, !"view_to_world", i32 2, !141, i32 3, i32 0, i32 7, i32 9}
!141 = !{i32 4, i32 4, i32 2}
!142 = !{i32 6, !"projection_to_world", i32 2, !141, i32 3, i32 64, i32 7, i32 9}
!143 = !{i32 80, !144}
!144 = !{i32 6, !"h", i32 3, i32 0}
!145 = !{i32 80, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!146 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!147 = !{i32 6, !"_pad0", i32 3, i32 12, i32 7, i32 9}
!148 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!149 = !{i32 6, !"_pad1", i32 3, i32 28, i32 7, i32 9}
!150 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!151 = !{i32 6, !"_pad2", i32 3, i32 44, i32 7, i32 9}
!152 = !{i32 6, !"bitangent", i32 3, i32 48, i32 7, i32 9}
!153 = !{i32 6, !"_pad3", i32 3, i32 60, i32 7, i32 9}
!154 = !{i32 6, !"uv", i32 3, i32 64, i32 7, i32 9}
!155 = !{i32 6, !"_pad4", i32 3, i32 72, i32 7, i32 9}
!156 = !{i32 16, !144}
!157 = !{i32 16, !158, !159}
!158 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!159 = !{i32 6, !"shininess", i32 3, i32 12, i32 7, i32 9}
!160 = !{i32 1076, !161, !162}
!161 = !{i32 6, !"point_lights", i32 3, i32 0}
!162 = !{i32 6, !"point_light_settings", i32 3, i32 320}
!163 = !{i32 32, !146, !164, !165}
!164 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9}
!165 = !{i32 6, !"intensity", i32 3, i32 28, i32 7, i32 9}
!166 = !{i32 756, !167, !168}
!167 = !{i32 6, !"count", i32 3, i32 0, i32 7, i32 4}
!168 = !{i32 6, !"_pad", i32 3, i32 16, i32 7, i32 4}
!169 = !{i32 16, !170, !171, !172, !173}
!170 = !{i32 6, !"vertex_offset", i32 3, i32 0, i32 7, i32 4}
!171 = !{i32 6, !"index_offset", i32 3, i32 4, i32 7, i32 4}
!172 = !{i32 6, !"material_id", i32 3, i32 8, i32 7, i32 4}
!173 = !{i32 6, !"_pad", i32 3, i32 12, i32 7, i32 4}
!174 = !{i32 32, !175, !176, !177, !178}
!175 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!176 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!177 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!178 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!179 = !{i32 16, !180}
!180 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!181 = !{i32 8, !182}
!182 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!183 = !{i32 144, !184}
!184 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!185 = !{i32 1076, !186}
!186 = !{i32 6, !"hitgroup_cb", i32 3, i32 0}
!187 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !188, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !190, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !193}
!188 = !{!189}
!189 = !{i32 1, !2, !2}
!190 = !{!189, !191, !192}
!191 = !{i32 2, !2, !2}
!192 = !{i32 0, !2, !2}
!193 = !{!189, !191}
!194 = !{null, !"", null, !110, !195}
!195 = !{i32 0, i64 65552}
!196 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !197}
!197 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !198}
!198 = !{i32 0}
!199 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !200}
!200 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !198}
!201 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !202}
!202 = !{i32 8, i32 7, i32 5, !198}
!203 = !DILocation(line: 95, column: 33, scope: !32)
!204 = !DILocation(line: 95, column: 63, scope: !32)
!205 = !DILocation(line: 95, column: 53, scope: !32)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !32, file: !1, line: 95, type: !4)
!207 = !DIExpression(DW_OP_bit_piece, 0, 32)
!208 = !DILocation(line: 95, column: 12, scope: !32)
!209 = !DIExpression(DW_OP_bit_piece, 32, 32)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj_dir", scope: !32, file: !1, line: 98, type: !14)
!211 = !DIExpression()
!212 = !DILocation(line: 98, column: 12, scope: !32)
!213 = !DILocation(line: 100, column: 56, scope: !32)
!214 = !DILocation(line: 100, column: 30, scope: !32)
!215 = !DILocation(line: 100, column: 5, scope: !32)
!216 = !DILocation(line: 101, column: 55, scope: !32)
!217 = !DILocation(line: 101, column: 30, scope: !32)
!218 = !DILocation(line: 101, column: 5, scope: !32)
!219 = !DILocation(line: 104, column: 47, scope: !32)
!220 = !DILocation(line: 104, column: 25, scope: !32)
!221 = !DILocation(line: 105, column: 24, scope: !32)
!222 = !DILocation(line: 105, column: 39, scope: !32)
!223 = !DILocation(line: 105, column: 38, scope: !32)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !32, file: !1, line: 105, type: !14)
!225 = !DILocation(line: 105, column: 12, scope: !32)
!226 = !DIExpression(DW_OP_bit_piece, 64, 32)
!227 = !DILocation(line: 107, column: 48, scope: !32)
!228 = !DILocation(line: 108, column: 25, scope: !32)
!229 = !DILocation(line: 108, column: 41, scope: !32)
!230 = !DILocation(line: 108, column: 40, scope: !32)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_pos", scope: !32, file: !1, line: 108, type: !14)
!232 = !DILocation(line: 108, column: 12, scope: !32)
!233 = !DILocation(line: 109, column: 44, scope: !32)
!234 = !DILocation(line: 109, column: 25, scope: !32)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "camera_dir", scope: !32, file: !1, line: 109, type: !14)
!236 = !DILocation(line: 109, column: 12, scope: !32)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 119, type: !45)
!238 = !DILocation(line: 119, column: 16, scope: !32)
!239 = !DILocation(line: 120, column: 5, scope: !32)
!240 = !DILocation(line: 123, column: 5, scope: !32)
!241 = !DILocation(line: 123, column: 42, scope: !32)
!242 = !DILocation(line: 124, column: 1, scope: !32)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !41, file: !1, line: 135, type: !48)
!244 = !DIExpression(DW_OP_deref)
!245 = !DILocation(line: 135, column: 67, scope: !41)
!246 = !DILocation(line: 137, column: 24, scope: !41)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_id", scope: !41, file: !1, line: 137, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 137, baseType: !58)
!249 = !DILocation(line: 137, column: 10, scope: !41)
!250 = !DILocation(line: 138, column: 25, scope: !41)
!251 = !DILocation(line: 138, column: 54, scope: !41)
!252 = !DILocation(line: 144, column: 12, scope: !41)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vertex_offset", scope: !41, file: !1, line: 138, type: !13)
!254 = !DILocation(line: 138, column: 9, scope: !41)
!255 = !DILocation(line: 139, column: 53, scope: !41)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index_offset", scope: !41, file: !1, line: 139, type: !13)
!257 = !DILocation(line: 139, column: 9, scope: !41)
!258 = !DILocation(line: 142, column: 17, scope: !41)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pidx", scope: !41, file: !1, line: 142, type: !248)
!260 = !DILocation(line: 142, column: 10, scope: !41)
!261 = !DILocation(line: 143, column: 41, scope: !41)
!262 = !DILocation(line: 143, column: 43, scope: !41)
!263 = !DILocation(line: 143, column: 57, scope: !41)
!264 = !DILocation(line: 143, column: 17, scope: !41)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !41, file: !1, line: 143, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 143, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 143, size: 96, align: 32, elements: !268, templateParams: !272)
!268 = !{!269, !270, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !267, file: !1, line: 143, baseType: !58, size: 32, align: 32, flags: DIFlagPublic)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !267, file: !1, line: 143, baseType: !58, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !267, file: !1, line: 143, baseType: !58, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!272 = !{!273, !21}
!273 = !DITemplateTypeParameter(name: "element", type: !58)
!274 = !DILocation(line: 143, column: 11, scope: !41)
!275 = !DILocation(line: 144, column: 9, scope: !41)
!276 = !DILocation(line: 147, column: 17, scope: !41)
!277 = !DILocation(line: 147, column: 38, scope: !41)
!278 = !DILocation(line: 148, column: 38, scope: !41)
!279 = !DILocation(line: 149, column: 38, scope: !41)
!280 = !DILocation(line: 150, column: 49, scope: !41)
!281 = !{!282, !282, i64 0}
!282 = !{!"omnipotent char", !283, i64 0}
!283 = !{!"Simple C/C++ TBAA"}
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barycentrics", arg: 4, scope: !35, file: !1, line: 126, type: !4)
!285 = !DILocation(line: 126, column: 78, scope: !35, inlinedAt: !286)
!286 = distinct !DILocation(line: 150, column: 17, scope: !41)
!287 = !DILocation(line: 127, column: 15, scope: !35, inlinedAt: !286)
!288 = !DILocation(line: 127, column: 33, scope: !35, inlinedAt: !286)
!289 = !DILocation(line: 127, column: 29, scope: !35, inlinedAt: !286)
!290 = !DILocation(line: 127, column: 14, scope: !35, inlinedAt: !286)
!291 = !DILocation(line: 127, column: 38, scope: !35, inlinedAt: !286)
!292 = !DILocation(line: 127, column: 56, scope: !35, inlinedAt: !286)
!293 = !DILocation(line: 127, column: 52, scope: !35, inlinedAt: !286)
!294 = !DILocation(line: 127, column: 37, scope: !35, inlinedAt: !286)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ni", scope: !41, file: !1, line: 150, type: !14)
!296 = !DILocation(line: 150, column: 12, scope: !41)
!297 = !DILocation(line: 151, column: 31, scope: !41)
!298 = !DILocation(line: 151, column: 27, scope: !41)
!299 = !DILocation(line: 131, column: 12, scope: !38, inlinedAt: !300)
!300 = distinct !DILocation(line: 154, column: 24, scope: !41)
!301 = !DILocation(line: 131, column: 29, scope: !38, inlinedAt: !300)
!302 = !DILocation(line: 131, column: 49, scope: !38, inlinedAt: !300)
!303 = !DILocation(line: 131, column: 48, scope: !38, inlinedAt: !300)
!304 = !DILocation(line: 131, column: 28, scope: !38, inlinedAt: !300)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world_pos", scope: !41, file: !1, line: 154, type: !14)
!306 = !DILocation(line: 154, column: 12, scope: !41)
!307 = !DILocation(line: 156, column: 18, scope: !41)
!308 = !DILocation(line: 156, column: 47, scope: !41)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat_id", scope: !41, file: !1, line: 156, type: !13)
!310 = !DILocation(line: 156, column: 9, scope: !41)
!311 = !DILocation(line: 158, column: 27, scope: !41)
!312 = !DILocation(line: 158, column: 51, scope: !41)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_a", scope: !41, file: !1, line: 159, type: !8)
!314 = !DILocation(line: 159, column: 11, scope: !41)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_d", scope: !41, file: !1, line: 160, type: !8)
!316 = !DILocation(line: 160, column: 11, scope: !41)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k_s", scope: !41, file: !1, line: 161, type: !8)
!318 = !DILocation(line: 161, column: 11, scope: !41)
!319 = !DILocation(line: 162, column: 47, scope: !41)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shininess", scope: !41, file: !1, line: 162, type: !8)
!321 = !DILocation(line: 162, column: 11, scope: !41)
!322 = !DILocation(line: 163, column: 16, scope: !41)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !41, file: !1, line: 163, type: !14)
!324 = !DILocation(line: 163, column: 12, scope: !41)
!325 = !DILocation(line: 164, column: 42, scope: !41)
!326 = !DILocation(line: 164, column: 16, scope: !41)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !41, file: !1, line: 164, type: !14)
!328 = !DILocation(line: 164, column: 12, scope: !41)
!329 = !DILocation(line: 166, column: 23, scope: !41)
